TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.7 *
       3                    ;* Date/Time created: Tue Sep 16 08:38:35 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --disable_dual_state --
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/Task_I2C7_Handler.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.7 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHub
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SysCtlPeripheralEnable")

    1429                    $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("eRunning"), DW_AT_const_value(0x00)
    1430                            .dwattr $C$DW$151, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    1431                            .dwattr $C$DW$151, DW_AT_decl_line(0x6e)
    1432                            .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    1433                    $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
    1434                            .dwattr $C$DW$152, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    1435                            .dwattr $C$DW$152, DW_AT_decl_line(0x6f)
    1436                            .dwattr $C$DW$152, DW_AT_decl_column(0x02)
    1437                    $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
    1438                            .dwattr $C$DW$153, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    1439                            .dwattr $C$DW$153, DW_AT_decl_line(0x70)
    1440                            .dwattr $C$DW$153, DW_AT_decl_column(0x02)
    1441                    $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
    1442                            .dwattr $C$DW$154, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    1443                            .dwattr $C$DW$154, DW_AT_decl_line(0x71)
    1444                            .dwattr $C$DW$154, DW_AT_decl_column(0x02)
    1445                    $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
    1446                            .dwattr $C$DW$155, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    1447                            .dwattr $C$DW$155, DW_AT_decl_line(0x72)
    1448                            .dwattr $C$DW$155, DW_AT_decl_column(0x02)
    1449                            .dwendtag $C$DW$T$68
    1450                    
    1451                            .dwattr $C$DW$T$68, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    1452                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x6d)
    1453                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
    1454                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
    1455                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1456                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1457                            .dwattr $C$DW$T$69, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    1458                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x73)
    1459                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    1460                    
    1461                    $C$DW$T$74      .dwtag  DW_TAG_enumeration_type
    1462                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    1463                    $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
    1464                            .dwattr $C$DW$156, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    1465                            .dwattr $C$DW$156, DW_AT_decl_line(0xa7)
    1466                            .dwattr $C$DW$156, DW_AT_decl_column(0x02)
    1467                    $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
    1468                            .dwattr $C$DW$157, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    1469                            .dwattr $C$DW$157, DW_AT_decl_line(0xa8)
    1470                            .dwattr $C$DW$157, DW_AT_decl_column(0x02)
    1471                    $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
    1472                            .dwattr $C$DW$158, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    1473                            .dwattr $C$DW$158, DW_AT_decl_line(0xa9)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   29

    1474                            .dwattr $C$DW$158, DW_AT_decl_column(0x02)
    1475                            .dwendtag $C$DW$T$74
    1476                    
    1477                            .dwattr $C$DW$T$74, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    1478                            .dwattr $C$DW$T$74, DW_AT_decl_line(0xa6)
    1479                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
    1480                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
    1481                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    1482                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1483                            .dwattr $C$DW$T$75, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    1484                            .dwattr $C$DW$T$75, DW_AT_decl_line(0xaa)
    1485                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    1486                    
    1487                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1488                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1489                    $C$DW$159       .dwtag  DW_TAG_member
    1490                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1491                            .dwattr $C$DW$159, DW_AT_name("ui8Addr")
    1492                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("ui8Addr")
    1493                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1495                            .dwattr $C$DW$159, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1496                            .dwattr $C$DW$159, DW_AT_decl_line(0x4c)
    1497                            .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    1498                    $C$DW$160       .dwtag  DW_TAG_member
    1499                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    1500                            .dwattr $C$DW$160, DW_AT_name("pui8WriteData")
    1501                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("pui8WriteData")
    1502                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1503                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1504                            .dwattr $C$DW$160, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1505                            .dwattr $C$DW$160, DW_AT_decl_line(0x51)
    1506                            .dwattr $C$DW$160, DW_AT_decl_column(0x14)
    1507                    $C$DW$161       .dwtag  DW_TAG_member
    1508                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$22)
    1509                            .dwattr $C$DW$161, DW_AT_name("ui16WriteCount")
    1510                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("ui16WriteCount")
    1511                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1512                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$161, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1514                            .dwattr $C$DW$161, DW_AT_decl_line(0x56)
    1515                            .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    1516                    $C$DW$162       .dwtag  DW_TAG_member
    1517                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    1518                            .dwattr $C$DW$162, DW_AT_name("ui16WriteBatchSize")
    1519                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1520                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1521                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1522                            .dwattr $C$DW$162, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1523                            .dwattr $C$DW$162, DW_AT_decl_line(0x5b)
    1524                            .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    1525                    $C$DW$163       .dwtag  DW_TAG_member
    1526                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
    1527                            .dwattr $C$DW$163, DW_AT_name("pui8ReadData")
    1528                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("pui8ReadData")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   30

    1529                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1530                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1531                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1532                            .dwattr $C$DW$163, DW_AT_decl_line(0x60)
    1533                            .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    1534                    $C$DW$164       .dwtag  DW_TAG_member
    1535                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$22)
    1536                            .dwattr $C$DW$164, DW_AT_name("ui16ReadCount")
    1537                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("ui16ReadCount")
    1538                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1539                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1540                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1541                            .dwattr $C$DW$164, DW_AT_decl_line(0x65)
    1542                            .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    1543                    $C$DW$165       .dwtag  DW_TAG_member
    1544                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    1545                            .dwattr $C$DW$165, DW_AT_name("ui16ReadBatchSize")
    1546                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1547                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1548                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1549                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1550                            .dwattr $C$DW$165, DW_AT_decl_line(0x6a)
    1551                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    1552                    $C$DW$166       .dwtag  DW_TAG_member
    1553                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$28)
    1554                            .dwattr $C$DW$166, DW_AT_name("pfnCallback")
    1555                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("pfnCallback")
    1556                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1557                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1558                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1559                            .dwattr $C$DW$166, DW_AT_decl_line(0x6f)
    1560                            .dwattr $C$DW$166, DW_AT_decl_column(0x16)
    1561                    $C$DW$167       .dwtag  DW_TAG_member
    1562                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$3)
    1563                            .dwattr $C$DW$167, DW_AT_name("pvCallbackData")
    1564                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("pvCallbackData")
    1565                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1566                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1567                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1568                            .dwattr $C$DW$167, DW_AT_decl_line(0x74)
    1569                            .dwattr $C$DW$167, DW_AT_decl_column(0x0b)
    1570                            .dwendtag $C$DW$T$29
    1571                    
    1572                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1573                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1574                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1575                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMCommand")
    1576                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1577                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1578                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1579                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1580                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1581                    
    1582                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1583                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   31

    1584                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1585                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1586                    $C$DW$168       .dwtag  DW_TAG_subrange_type
    1587                            .dwattr $C$DW$168, DW_AT_upper_bound(0x09)
    1588                            .dwendtag $C$DW$T$31
    1589                    
    1590                    
    1591                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1592                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1593                    $C$DW$169       .dwtag  DW_TAG_member
    1594                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$24)
    1595                            .dwattr $C$DW$169, DW_AT_name("ui32Base")
    1596                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("ui32Base")
    1597                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1599                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1600                            .dwattr $C$DW$169, DW_AT_decl_line(0x82)
    1601                            .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    1602                    $C$DW$170       .dwtag  DW_TAG_member
    1603                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1604                            .dwattr $C$DW$170, DW_AT_name("ui8Int")
    1605                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("ui8Int")
    1606                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1607                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1608                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1609                            .dwattr $C$DW$170, DW_AT_decl_line(0x87)
    1610                            .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    1611                    $C$DW$171       .dwtag  DW_TAG_member
    1612                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1613                            .dwattr $C$DW$171, DW_AT_name("ui8TxDMA")
    1614                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("ui8TxDMA")
    1615                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1616                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1617                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1618                            .dwattr $C$DW$171, DW_AT_decl_line(0x8c)
    1619                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    1620                    $C$DW$172       .dwtag  DW_TAG_member
    1621                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1622                            .dwattr $C$DW$172, DW_AT_name("ui8RxDMA")
    1623                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("ui8RxDMA")
    1624                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1625                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1626                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1627                            .dwattr $C$DW$172, DW_AT_decl_line(0x91)
    1628                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    1629                    $C$DW$173       .dwtag  DW_TAG_member
    1630                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1631                            .dwattr $C$DW$173, DW_AT_name("ui8State")
    1632                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ui8State")
    1633                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1634                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1635                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1636                            .dwattr $C$DW$173, DW_AT_decl_line(0x96)
    1637                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    1638                    $C$DW$174       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   32

    1639                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1640                            .dwattr $C$DW$174, DW_AT_name("ui8ReadPtr")
    1641                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ui8ReadPtr")
    1642                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1643                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1644                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1645                            .dwattr $C$DW$174, DW_AT_decl_line(0x9c)
    1646                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    1647                    $C$DW$175       .dwtag  DW_TAG_member
    1648                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1649                            .dwattr $C$DW$175, DW_AT_name("ui8WritePtr")
    1650                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ui8WritePtr")
    1651                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1652                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1653                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1654                            .dwattr $C$DW$175, DW_AT_decl_line(0xa2)
    1655                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    1656                    $C$DW$176       .dwtag  DW_TAG_member
    1657                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    1658                            .dwattr $C$DW$176, DW_AT_name("ui16Index")
    1659                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("ui16Index")
    1660                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1661                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1662                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1663                            .dwattr $C$DW$176, DW_AT_decl_line(0xa7)
    1664                            .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    1665                    $C$DW$177       .dwtag  DW_TAG_member
    1666                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1667                            .dwattr $C$DW$177, DW_AT_name("pCommands")
    1668                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("pCommands")
    1669                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1670                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1671                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1672                            .dwattr $C$DW$177, DW_AT_decl_line(0xac)
    1673                            .dwattr $C$DW$177, DW_AT_decl_column(0x12)
    1674                            .dwendtag $C$DW$T$32
    1675                    
    1676                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1677                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    1678                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    1679                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMInstance")
    1680                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1681                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1682                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1683                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    1684                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    1685                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1686                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1687                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1688                    
    1689                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1690                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    1691                    $C$DW$178       .dwtag  DW_TAG_member
    1692                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$34)
    1693                            .dwattr $C$DW$178, DW_AT_name("psI2CInst")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   33

    1694                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("psI2CInst")
    1695                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1697                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1698                            .dwattr $C$DW$178, DW_AT_decl_line(0xf0)
    1699                            .dwattr $C$DW$178, DW_AT_decl_column(0x14)
    1700                    $C$DW$179       .dwtag  DW_TAG_member
    1701                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$35)
    1702                            .dwattr $C$DW$179, DW_AT_name("pui8Buffer")
    1703                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("pui8Buffer")
    1704                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1705                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1706                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1707                            .dwattr $C$DW$179, DW_AT_decl_line(0xf5)
    1708                            .dwattr $C$DW$179, DW_AT_decl_column(0x0d)
    1709                    $C$DW$180       .dwtag  DW_TAG_member
    1710                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1711                            .dwattr $C$DW$180, DW_AT_name("ui8State")
    1712                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("ui8State")
    1713                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1714                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1715                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1716                            .dwattr $C$DW$180, DW_AT_decl_line(0xfa)
    1717                            .dwattr $C$DW$180, DW_AT_decl_column(0x0d)
    1718                    $C$DW$181       .dwtag  DW_TAG_member
    1719                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1720                            .dwattr $C$DW$181, DW_AT_name("ui8Addr")
    1721                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("ui8Addr")
    1722                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1723                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1724                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1725                            .dwattr $C$DW$181, DW_AT_decl_line(0xff)
    1726                            .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    1727                    $C$DW$182       .dwtag  DW_TAG_member
    1728                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    1729                            .dwattr $C$DW$182, DW_AT_name("ui16Mask")
    1730                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui16Mask")
    1731                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1732                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1733                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1734                            .dwattr $C$DW$182, DW_AT_decl_line(0x104)
    1735                            .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    1736                    $C$DW$183       .dwtag  DW_TAG_member
    1737                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    1738                            .dwattr $C$DW$183, DW_AT_name("ui16Value")
    1739                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui16Value")
    1740                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1741                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1742                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1743                            .dwattr $C$DW$183, DW_AT_decl_line(0x109)
    1744                            .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    1745                    $C$DW$184       .dwtag  DW_TAG_member
    1746                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$28)
    1747                            .dwattr $C$DW$184, DW_AT_name("pfnCallback")
    1748                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("pfnCallback")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   34

    1749                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1750                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1751                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1752                            .dwattr $C$DW$184, DW_AT_decl_line(0x10f)
    1753                            .dwattr $C$DW$184, DW_AT_decl_column(0x16)
    1754                    $C$DW$185       .dwtag  DW_TAG_member
    1755                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$3)
    1756                            .dwattr $C$DW$185, DW_AT_name("pvCallbackData")
    1757                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("pvCallbackData")
    1758                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1759                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1760                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1761                            .dwattr $C$DW$185, DW_AT_decl_line(0x114)
    1762                            .dwattr $C$DW$185, DW_AT_decl_column(0x0b)
    1763                            .dwendtag $C$DW$T$36
    1764                    
    1765                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1766                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    1767                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    1768                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMReadModifyWrite16")
    1769                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$36)
    1770                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1771                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1772                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x116)
    1773                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    1774                    $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    1775                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    1776                            .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    1777                    
    1778                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1779                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    1780                    $C$DW$186       .dwtag  DW_TAG_member
    1781                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$34)
    1782                            .dwattr $C$DW$186, DW_AT_name("psI2CInst")
    1783                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("psI2CInst")
    1784                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1786                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1787                            .dwattr $C$DW$186, DW_AT_decl_line(0xbc)
    1788                            .dwattr $C$DW$186, DW_AT_decl_column(0x14)
    1789                    $C$DW$187       .dwtag  DW_TAG_member
    1790                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$35)
    1791                            .dwattr $C$DW$187, DW_AT_name("pui8Buffer")
    1792                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("pui8Buffer")
    1793                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1794                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1795                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1796                            .dwattr $C$DW$187, DW_AT_decl_line(0xc1)
    1797                            .dwattr $C$DW$187, DW_AT_decl_column(0x0d)
    1798                    $C$DW$188       .dwtag  DW_TAG_member
    1799                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1800                            .dwattr $C$DW$188, DW_AT_name("ui8State")
    1801                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("ui8State")
    1802                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1803                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   35

    1804                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1805                            .dwattr $C$DW$188, DW_AT_decl_line(0xc6)
    1806                            .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    1807                    $C$DW$189       .dwtag  DW_TAG_member
    1808                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1809                            .dwattr $C$DW$189, DW_AT_name("ui8Addr")
    1810                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("ui8Addr")
    1811                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1812                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1813                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1814                            .dwattr $C$DW$189, DW_AT_decl_line(0xcb)
    1815                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    1816                    $C$DW$190       .dwtag  DW_TAG_member
    1817                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1818                            .dwattr $C$DW$190, DW_AT_name("ui8Mask")
    1819                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("ui8Mask")
    1820                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1821                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1822                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1823                            .dwattr $C$DW$190, DW_AT_decl_line(0xd0)
    1824                            .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    1825                    $C$DW$191       .dwtag  DW_TAG_member
    1826                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1827                            .dwattr $C$DW$191, DW_AT_name("ui8Value")
    1828                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("ui8Value")
    1829                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1830                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1831                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1832                            .dwattr $C$DW$191, DW_AT_decl_line(0xd5)
    1833                            .dwattr $C$DW$191, DW_AT_decl_column(0x0d)
    1834                    $C$DW$192       .dwtag  DW_TAG_member
    1835                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$28)
    1836                            .dwattr $C$DW$192, DW_AT_name("pfnCallback")
    1837                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("pfnCallback")
    1838                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1839                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1840                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1841                            .dwattr $C$DW$192, DW_AT_decl_line(0xdb)
    1842                            .dwattr $C$DW$192, DW_AT_decl_column(0x16)
    1843                    $C$DW$193       .dwtag  DW_TAG_member
    1844                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$3)
    1845                            .dwattr $C$DW$193, DW_AT_name("pvCallbackData")
    1846                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("pvCallbackData")
    1847                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1848                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1849                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1850                            .dwattr $C$DW$193, DW_AT_decl_line(0xe0)
    1851                            .dwattr $C$DW$193, DW_AT_decl_column(0x0b)
    1852                            .dwendtag $C$DW$T$37
    1853                    
    1854                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1855                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xb7)
    1856                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    1857                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMReadModifyWrite8")
    1858                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$37)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   36

    1859                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1860                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1861                            .dwattr $C$DW$T$78, DW_AT_decl_line(0xe2)
    1862                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
    1863                    
    1864                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1865                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1866                    $C$DW$194       .dwtag  DW_TAG_member
    1867                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$34)
    1868                            .dwattr $C$DW$194, DW_AT_name("psI2CInst")
    1869                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("psI2CInst")
    1870                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1872                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1873                            .dwattr $C$DW$194, DW_AT_decl_line(0x123)
    1874                            .dwattr $C$DW$194, DW_AT_decl_column(0x14)
    1875                    $C$DW$195       .dwtag  DW_TAG_member
    1876                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$38)
    1877                            .dwattr $C$DW$195, DW_AT_name("pui8Buffer")
    1878                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("pui8Buffer")
    1879                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1880                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1881                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1882                            .dwattr $C$DW$195, DW_AT_decl_line(0x128)
    1883                            .dwattr $C$DW$195, DW_AT_decl_column(0x0d)
    1884                    $C$DW$196       .dwtag  DW_TAG_member
    1885                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    1886                            .dwattr $C$DW$196, DW_AT_name("ui16Count")
    1887                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("ui16Count")
    1888                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1889                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1890                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1891                            .dwattr $C$DW$196, DW_AT_decl_line(0x12d)
    1892                            .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    1893                    $C$DW$197       .dwtag  DW_TAG_member
    1894                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    1895                            .dwattr $C$DW$197, DW_AT_name("pui8Data")
    1896                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("pui8Data")
    1897                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1898                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1899                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1900                            .dwattr $C$DW$197, DW_AT_decl_line(0x132)
    1901                            .dwattr $C$DW$197, DW_AT_decl_column(0x14)
    1902                    $C$DW$198       .dwtag  DW_TAG_member
    1903                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$28)
    1904                            .dwattr $C$DW$198, DW_AT_name("pfnCallback")
    1905                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("pfnCallback")
    1906                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1907                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1908                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1909                            .dwattr $C$DW$198, DW_AT_decl_line(0x137)
    1910                            .dwattr $C$DW$198, DW_AT_decl_column(0x16)
    1911                    $C$DW$199       .dwtag  DW_TAG_member
    1912                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$3)
    1913                            .dwattr $C$DW$199, DW_AT_name("pvCallbackData")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   37

    1914                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("pvCallbackData")
    1915                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1916                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1917                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1918                            .dwattr $C$DW$199, DW_AT_decl_line(0x13c)
    1919                            .dwattr $C$DW$199, DW_AT_decl_column(0x0b)
    1920                            .dwendtag $C$DW$T$39
    1921                    
    1922                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1923                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x11e)
    1924                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    1925                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMWrite8")
    1926                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$39)
    1927                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1928                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1929                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x13e)
    1930                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x01)
    1931                    
    1932                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1933                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
    1934                    $C$DW$200       .dwtag  DW_TAG_member
    1935                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$34)
    1936                            .dwattr $C$DW$200, DW_AT_name("psI2CInst")
    1937                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("psI2CInst")
    1938                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1939                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1940                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1941                            .dwattr $C$DW$200, DW_AT_decl_line(0x14c)
    1942                            .dwattr $C$DW$200, DW_AT_decl_column(0x14)
    1943                    $C$DW$201       .dwtag  DW_TAG_member
    1944                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$23)
    1945                            .dwattr $C$DW$201, DW_AT_name("pui8Data")
    1946                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("pui8Data")
    1947                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1948                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1949                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1950                            .dwattr $C$DW$201, DW_AT_decl_line(0x151)
    1951                            .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    1952                    $C$DW$202       .dwtag  DW_TAG_member
    1953                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    1954                            .dwattr $C$DW$202, DW_AT_name("ui16Count")
    1955                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("ui16Count")
    1956                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1957                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1958                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1959                            .dwattr $C$DW$202, DW_AT_decl_line(0x156)
    1960                            .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    1961                    $C$DW$203       .dwtag  DW_TAG_member
    1962                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$28)
    1963                            .dwattr $C$DW$203, DW_AT_name("pfnCallback")
    1964                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("pfnCallback")
    1965                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1966                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1967                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1968                            .dwattr $C$DW$203, DW_AT_decl_line(0x15b)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   38

    1969                            .dwattr $C$DW$203, DW_AT_decl_column(0x16)
    1970                    $C$DW$204       .dwtag  DW_TAG_member
    1971                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$3)
    1972                            .dwattr $C$DW$204, DW_AT_name("pvCallbackData")
    1973                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("pvCallbackData")
    1974                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1975                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1976                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1977                            .dwattr $C$DW$204, DW_AT_decl_line(0x160)
    1978                            .dwattr $C$DW$204, DW_AT_decl_column(0x0b)
    1979                            .dwendtag $C$DW$T$40
    1980                    
    1981                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1982                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x147)
    1983                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    1984                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMRead16BE")
    1985                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$40)
    1986                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1987                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1988                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x162)
    1989                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x01)
    1990                    
    1991                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1992                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x14)
    1993                    $C$DW$205       .dwtag  DW_TAG_member
    1994                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$34)
    1995                            .dwattr $C$DW$205, DW_AT_name("psI2CInst")
    1996                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("psI2CInst")
    1997                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1999                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2000                            .dwattr $C$DW$205, DW_AT_decl_line(0x170)
    2001                            .dwattr $C$DW$205, DW_AT_decl_column(0x14)
    2002                    $C$DW$206       .dwtag  DW_TAG_member
    2003                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$38)
    2004                            .dwattr $C$DW$206, DW_AT_name("pui8Buffer")
    2005                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pui8Buffer")
    2006                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2007                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2008                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2009                            .dwattr $C$DW$206, DW_AT_decl_line(0x175)
    2010                            .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    2011                    $C$DW$207       .dwtag  DW_TAG_member
    2012                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$22)
    2013                            .dwattr $C$DW$207, DW_AT_name("ui16Count")
    2014                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("ui16Count")
    2015                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2016                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2017                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2018                            .dwattr $C$DW$207, DW_AT_decl_line(0x17a)
    2019                            .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    2020                    $C$DW$208       .dwtag  DW_TAG_member
    2021                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    2022                            .dwattr $C$DW$208, DW_AT_name("pui8Data")
    2023                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("pui8Data")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   39

    2024                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2025                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2026                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2027                            .dwattr $C$DW$208, DW_AT_decl_line(0x17f)
    2028                            .dwattr $C$DW$208, DW_AT_decl_column(0x14)
    2029                    $C$DW$209       .dwtag  DW_TAG_member
    2030                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$28)
    2031                            .dwattr $C$DW$209, DW_AT_name("pfnCallback")
    2032                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("pfnCallback")
    2033                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2034                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2035                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2036                            .dwattr $C$DW$209, DW_AT_decl_line(0x184)
    2037                            .dwattr $C$DW$209, DW_AT_decl_column(0x16)
    2038                    $C$DW$210       .dwtag  DW_TAG_member
    2039                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$3)
    2040                            .dwattr $C$DW$210, DW_AT_name("pvCallbackData")
    2041                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("pvCallbackData")
    2042                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2043                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2044                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2045                            .dwattr $C$DW$210, DW_AT_decl_line(0x189)
    2046                            .dwattr $C$DW$210, DW_AT_decl_column(0x0b)
    2047                            .dwendtag $C$DW$T$41
    2048                    
    2049                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2050                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x16b)
    2051                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2052                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMWrite16BE")
    2053                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$41)
    2054                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2055                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2056                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x18b)
    2057                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x01)
    2058                    
    2059                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2060                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x18)
    2061                    $C$DW$211       .dwtag  DW_TAG_member
    2062                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$10)
    2063                            .dwattr $C$DW$211, DW_AT_name("fd")
    2064                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("fd")
    2065                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2066                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2067                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    2068                            .dwattr $C$DW$211, DW_AT_decl_line(0x5b)
    2069                            .dwattr $C$DW$211, DW_AT_decl_column(0x0b)
    2070                    $C$DW$212       .dwtag  DW_TAG_member
    2071                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$42)
    2072                            .dwattr $C$DW$212, DW_AT_name("buf")
    2073                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("buf")
    2074                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2075                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2076                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    2077                            .dwattr $C$DW$212, DW_AT_decl_line(0x5c)
    2078                            .dwattr $C$DW$212, DW_AT_decl_column(0x16)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   40

    2079                    $C$DW$213       .dwtag  DW_TAG_member
    2080                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$42)
    2081                            .dwattr $C$DW$213, DW_AT_name("pos")
    2082                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("pos")
    2083                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2084                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2085                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    2086                            .dwattr $C$DW$213, DW_AT_decl_line(0x5d)
    2087                            .dwattr $C$DW$213, DW_AT_decl_column(0x16)
    2088                    $C$DW$214       .dwtag  DW_TAG_member
    2089                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$42)
    2090                            .dwattr $C$DW$214, DW_AT_name("bufend")
    2091                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("bufend")
    2092                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2093                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2094                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    2095                            .dwattr $C$DW$214, DW_AT_decl_line(0x5e)
    2096                            .dwattr $C$DW$214, DW_AT_decl_column(0x16)
    2097                    $C$DW$215       .dwtag  DW_TAG_member
    2098                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$42)
    2099                            .dwattr $C$DW$215, DW_AT_name("buff_stop")
    2100                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("buff_stop")
    2101                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2102                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2103                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    2104                            .dwattr $C$DW$215, DW_AT_decl_line(0x5f)
    2105                            .dwattr $C$DW$215, DW_AT_decl_column(0x16)
    2106                    $C$DW$216       .dwtag  DW_TAG_member
    2107                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$11)
    2108                            .dwattr $C$DW$216, DW_AT_name("flags")
    2109                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("flags")
    2110                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2111                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2112                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    2113                            .dwattr $C$DW$216, DW_AT_decl_line(0x60)
    2114                            .dwattr $C$DW$216, DW_AT_decl_column(0x16)
    2115                            .dwendtag $C$DW$T$43
    2116                    
    2117                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    2118                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x5a)
    2119                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    2120                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    2121                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$43)
    2122                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2123                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    2124                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x61)
    2125                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    2126                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2127                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2128                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2129                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2130                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2131                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    2132                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$3)
    2133                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   41

    2134                            .dwattr $C$DW$T$83, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2135                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x54)
    2136                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x10)
    2137                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    2138                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    2139                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2140                            .dwattr $C$DW$T$84, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    2141                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x4b)
    2142                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x17)
    2143                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("QueueSetHandle_t")
    2144                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$3)
    2145                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2146                            .dwattr $C$DW$T$85, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2147                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x5b)
    2148                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x10)
    2149                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("QueueSetMemberHandle_t")
    2150                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$3)
    2151                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2152                            .dwattr $C$DW$T$86, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2153                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x62)
    2154                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x10)
    2155                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    2156                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$3)
    2157                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2158                            .dwattr $C$DW$T$67, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    2159                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x63)
    2160                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x10)
    2161                    
    2162                    $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    2163                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2164                    $C$DW$217       .dwtag  DW_TAG_formal_parameter
    2165                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$3)
    2166                    $C$DW$218       .dwtag  DW_TAG_formal_parameter
    2167                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$25)
    2168                            .dwendtag $C$DW$T$26
    2169                    
    2170                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("tSensorCallback")
    2171                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2172                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2173                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2174                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2c)
    2175                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0f)
    2176                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2177                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2178                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    2179                    
    2180                    $C$DW$T$55      .dwtag  DW_TAG_subroutine_type
    2181                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2182                    $C$DW$219       .dwtag  DW_TAG_formal_parameter
    2183                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$3)
    2184                            .dwendtag $C$DW$T$55
    2185                    
    2186                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    2187                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2188                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   42

    2189                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    2190                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2191                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2192                            .dwattr $C$DW$T$57, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2193                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x49)
    2194                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
    2195                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2196                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2197                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2198                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2199                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2200                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2201                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2202                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2203                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2204                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$5)
    2205                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2206                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2207                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x2a)
    2208                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x1d)
    2209                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    2210                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    2211                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    2212                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2213                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x37)
    2214                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x17)
    2215                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2216                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2217                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2218                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2219                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2220                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$6)
    2221                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    2222                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    2223                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    2224                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2225                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    2226                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    2227                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    2228                    $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    2229                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$19)
    2230                            .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
    2231                    
    2232                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    2233                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    2234                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2235                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    2236                    $C$DW$220       .dwtag  DW_TAG_subrange_type
    2237                            .dwattr $C$DW$220, DW_AT_upper_bound(0x03)
    2238                            .dwendtag $C$DW$T$35
    2239                    
    2240                    
    2241                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    2242                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$19)
    2243                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   43

    2244                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2245                    $C$DW$221       .dwtag  DW_TAG_subrange_type
    2246                            .dwattr $C$DW$221, DW_AT_upper_bound(0x01)
    2247                            .dwendtag $C$DW$T$38
    2248                    
    2249                    
    2250                    $C$DW$T$105     .dwtag  DW_TAG_array_type
    2251                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$19)
    2252                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    2253                            .dwattr $C$DW$T$105, DW_AT_byte_size(0x08)
    2254                    $C$DW$222       .dwtag  DW_TAG_subrange_type
    2255                            .dwattr $C$DW$222, DW_AT_upper_bound(0x07)
    2256                            .dwendtag $C$DW$T$105
    2257                    
    2258                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("portCHAR")
    2259                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$19)
    2260                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    2261                            .dwattr $C$DW$T$106, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Senso
    2262                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x61)
    2263                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x12)
    2264                    $C$DW$T$20      .dwtag  DW_TAG_const_type
    2265                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    2266                    $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    2267                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    2268                            .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    2269                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    2270                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$19)
    2271                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    2272                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2273                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x38)
    2274                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x16)
    2275                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2276                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2277                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2278                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2279                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2280                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2281                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2282                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2283                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    2284                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$8)
    2285                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    2286                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2287                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x2c)
    2288                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x1d)
    2289                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    2290                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    2291                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2292                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2293                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x3a)
    2294                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x17)
    2295                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("portSHORT")
    2296                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$108)
    2297                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    2298                            .dwattr $C$DW$T$110, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Senso
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   44

    2299                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x65)
    2300                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x12)
    2301                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2302                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2303                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2304                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2305                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    2306                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$9)
    2307                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    2308                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2309                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x1fe)
    2310                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x21)
    2311                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    2312                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$9)
    2313                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    2314                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2315                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x1ff)
    2316                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x21)
    2317                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2318                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$9)
    2319                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2320                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    2321                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2d)
    2322                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x1c)
    2323                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    2324                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$22)
    2325                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    2326                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2327                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x3b)
    2328                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x16)
    2329                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    2330                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$9)
    2331                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2332                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2333                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x3c)
    2334                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x1a)
    2335                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2336                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2337                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2338                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2339                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    2340                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$10)
    2341                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    2342                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2343                            .dwattr $C$DW$T$115, DW_AT_decl_line(0xa6)
    2344                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x1e)
    2345                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    2346                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$10)
    2347                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2348                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    2349                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x2e)
    2350                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x1d)
    2351                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("BaseType_t")
    2352                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    2353                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   45

    2354                            .dwattr $C$DW$T$72, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2355                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x6a)
    2356                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x12)
    2357                    
    2358                    $C$DW$T$116     .dwtag  DW_TAG_subroutine_type
    2359                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$72)
    2360                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    2361                    $C$DW$223       .dwtag  DW_TAG_formal_parameter
    2362                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$3)
    2363                            .dwendtag $C$DW$T$116
    2364                    
    2365                    $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    2366                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    2367                            .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
    2368                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("TaskHookFunction_t")
    2369                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    2370                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    2371                            .dwattr $C$DW$T$118, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Senso
    2372                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x69)
    2373                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x16)
    2374                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    2375                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$71)
    2376                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    2377                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2378                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x47)
    2379                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x17)
    2380                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    2381                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$71)
    2382                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    2383                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2384                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x4a)
    2385                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x17)
    2386                    $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    2387                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$71)
    2388                            .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    2389                            .dwattr $C$DW$T$121, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2390                            .dwattr $C$DW$T$121, DW_AT_decl_line(0x45)
    2391                            .dwattr $C$DW$T$121, DW_AT_decl_column(0x17)
    2392                    $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    2393                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$71)
    2394                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    2395                            .dwattr $C$DW$T$122, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2396                            .dwattr $C$DW$T$122, DW_AT_decl_line(0x3c)
    2397                            .dwattr $C$DW$T$122, DW_AT_decl_column(0x17)
    2398                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("portBASE_TYPE")
    2399                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$71)
    2400                            .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    2401                            .dwattr $C$DW$T$123, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Senso
    2402                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x67)
    2403                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x12)
    2404                    $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("portLONG")
    2405                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$71)
    2406                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    2407                            .dwattr $C$DW$T$124, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Senso
    2408                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x64)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   46

    2409                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x12)
    2410                    $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    2411                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$10)
    2412                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    2413                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2414                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x52)
    2415                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x1a)
    2416                    $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    2417                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$10)
    2418                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    2419                            .dwattr $C$DW$T$126, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2420                            .dwattr $C$DW$T$126, DW_AT_decl_line(0x31)
    2421                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x1c)
    2422                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    2423                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2424                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2425                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    2426                    $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    2427                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$11)
    2428                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    2429                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2430                            .dwattr $C$DW$T$127, DW_AT_decl_line(0xac)
    2431                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x1a)
    2432                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    2433                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$11)
    2434                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    2435                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2436                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x35)
    2437                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x19)
    2438                    $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    2439                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$11)
    2440                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2441                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    2442                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x2f)
    2443                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x1c)
    2444                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("StackType_t")
    2445                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$24)
    2446                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2447                            .dwattr $C$DW$T$62, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2448                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x69)
    2449                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x12)
    2450                    $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    2451                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    2452                            .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    2453                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
    2454                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$24)
    2455                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2456                            .dwattr $C$DW$T$50, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2457                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x71)
    2458                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x16)
    2459                    $C$DW$T$98      .dwtag  DW_TAG_const_type
    2460                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$50)
    2461                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    2462                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$24)
    2463                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:35 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   47

    2464                            .dwattr $C$DW$T$45, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2465                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x6b)
    2466                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x12)
    2467                    $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("portSTACK_TYPE")
    2468                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$24)
    2469                            .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    2470                            .dwattr $C$DW$T$129, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Senso
    2471                            .dwattr $C$DW$T$129, DW_AT_decl_line(0x66)
    2472                            .dwattr $C$DW$T$129, DW_AT_decl_column(0x12)
    2473                    $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    2474                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$24)
    2475                            .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    2476                            .dwattr $C$DW$T$130, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2477                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x48)
    2478                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x16)
    2479                    $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    2480                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$24)
    2481                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    2482                            .dwattr $C$DW$T$131, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2483                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x4b)
    2484                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x16)
    2485                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    2486                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2487                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2488                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    2489                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x46)
    2490                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x16)
    2491                    $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    2492                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$24)
    2493                            .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    2494                            .dwattr $C$DW$T$140, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2495                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x3d)
    2496                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x16)
    2497                    $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    2498                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$11)
    2499                            .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    2500                            .dwattr $C$DW$T$141, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2501                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x53)
    2502                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x1a)
    2503                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    2504                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2505                            .dwattr $C$DW$T$12, DW_AT_name("long")
    2506                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    2507                    $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    2508                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$12)
    2509                            .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    2510                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2511                            .dwattr $C$DW$T$142, DW_AT_decl_line(0xa2)
    2512                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x0e)
    2513                    $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    2514                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$12)
    2515                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
