TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.7 *
       3                    ;* Date/Time created: Tue Sep 16 08:38:37 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --disable_dual_state --
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/croutine.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.7 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHub
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ulPortSetInterruptMask")

    1954                            .dwattr $C$DW$T$126, DW_AT_decl_line(0x33)
    1955                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x20)
    1956                    $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    1957                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    1958                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    1959                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1960                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x4f)
    1961                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x16)
    1962                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    1963                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$126)
    1964                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    1965                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1966                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x41)
    1967                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x16)
    1968                    $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    1969                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$15)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   37

    1970                            .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    1971                            .dwattr $C$DW$T$129, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1972                            .dwattr $C$DW$T$129, DW_AT_decl_line(0x57)
    1973                            .dwattr $C$DW$T$129, DW_AT_decl_column(0x20)
    1974                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1975                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1976                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1977                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1978                    $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("portFLOAT")
    1979                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$16)
    1980                            .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    1981                            .dwattr $C$DW$T$130, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Senso
    1982                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x62)
    1983                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x10)
    1984                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1985                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1986                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1987                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1988                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1989                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1990                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1991                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1992                    $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("_Sysch_t")
    1993                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$6)
    1994                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    1995                            .dwattr $C$DW$T$131, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1996                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x23a)
    1997                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x0e)
    1998                    $C$DW$T$41      .dwtag  DW_TAG_const_type
    1999                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$6)
    2000                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2001                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2002                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    2003                    $C$DW$T$43      .dwtag  DW_TAG_const_type
    2004                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2005                    $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    2006                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$6)
    2007                            .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    2008                    $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("__builtin_va_list")
    2009                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    2010                            .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    2011                            .dwattr $C$DW$T$133, DW_AT_decl_file("../Source/croutine.c")
    2012                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x181)
    2013                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x01)
    2014                    
    2015                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2016                            .dwattr $C$DW$T$19, DW_AT_name("__va_list")
    2017                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    2018                    $C$DW$110       .dwtag  DW_TAG_member
    2019                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$3)
    2020                            .dwattr $C$DW$110, DW_AT_name("__ap")
    2021                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("__ap")
    2022                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2024                            .dwattr $C$DW$110, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   38

    2025                            .dwattr $C$DW$110, DW_AT_decl_line(0x32)
    2026                            .dwattr $C$DW$110, DW_AT_decl_column(0x0c)
    2027                            .dwendtag $C$DW$T$19
    2028                    
    2029                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    2030                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x31)
    2031                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    2032                    $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    2033                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$19)
    2034                            .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    2035                            .dwattr $C$DW$T$134, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2036                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x33)
    2037                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x03)
    2038                    $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("_Va_list")
    2039                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    2040                            .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    2041                            .dwattr $C$DW$T$135, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    2042                            .dwattr $C$DW$T$135, DW_AT_decl_line(0x218)
    2043                            .dwattr $C$DW$T$135, DW_AT_decl_column(0x17)
    2044                    
    2045                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2046                            .dwattr $C$DW$T$28, DW_AT_name("corCoRoutineControlBlock")
    2047                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x38)
    2048                    $C$DW$111       .dwtag  DW_TAG_member
    2049                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$25)
    2050                            .dwattr $C$DW$111, DW_AT_name("pxCoRoutineFunction")
    2051                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("pxCoRoutineFunction")
    2052                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2054                            .dwattr $C$DW$111, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2055                            .dwattr $C$DW$111, DW_AT_decl_line(0x59)
    2056                            .dwattr $C$DW$111, DW_AT_decl_column(0x14)
    2057                    $C$DW$112       .dwtag  DW_TAG_member
    2058                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$26)
    2059                            .dwattr $C$DW$112, DW_AT_name("xGenericListItem")
    2060                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("xGenericListItem")
    2061                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2062                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2063                            .dwattr $C$DW$112, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2064                            .dwattr $C$DW$112, DW_AT_decl_line(0x5a)
    2065                            .dwattr $C$DW$112, DW_AT_decl_column(0x0f)
    2066                    $C$DW$113       .dwtag  DW_TAG_member
    2067                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$26)
    2068                            .dwattr $C$DW$113, DW_AT_name("xEventListItem")
    2069                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("xEventListItem")
    2070                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2071                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2072                            .dwattr $C$DW$113, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2073                            .dwattr $C$DW$113, DW_AT_decl_line(0x5b)
    2074                            .dwattr $C$DW$113, DW_AT_decl_column(0x0f)
    2075                    $C$DW$114       .dwtag  DW_TAG_member
    2076                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    2077                            .dwattr $C$DW$114, DW_AT_name("uxPriority")
    2078                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("uxPriority")
    2079                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   39

    2080                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2081                            .dwattr $C$DW$114, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2082                            .dwattr $C$DW$114, DW_AT_decl_line(0x5c)
    2083                            .dwattr $C$DW$114, DW_AT_decl_column(0x10)
    2084                    $C$DW$115       .dwtag  DW_TAG_member
    2085                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    2086                            .dwattr $C$DW$115, DW_AT_name("uxIndex")
    2087                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("uxIndex")
    2088                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2089                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2090                            .dwattr $C$DW$115, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2091                            .dwattr $C$DW$115, DW_AT_decl_line(0x5d)
    2092                            .dwattr $C$DW$115, DW_AT_decl_column(0x10)
    2093                    $C$DW$116       .dwtag  DW_TAG_member
    2094                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$27)
    2095                            .dwattr $C$DW$116, DW_AT_name("uxState")
    2096                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("uxState")
    2097                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2098                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2099                            .dwattr $C$DW$116, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2100                            .dwattr $C$DW$116, DW_AT_decl_line(0x5e)
    2101                            .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    2102                            .dwendtag $C$DW$T$28
    2103                    
    2104                            .dwattr $C$DW$T$28, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    2105                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x57)
    2106                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2107                    $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("CRCB_t")
    2108                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$28)
    2109                            .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    2110                            .dwattr $C$DW$T$136, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Senso
    2111                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x5f)
    2112                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x03)
    2113                    $C$DW$T$137     .dwtag  DW_TAG_pointer_type
    2114                            .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    2115                            .dwattr $C$DW$T$137, DW_AT_address_class(0x20)
    2116                    
    2117                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2118                            .dwattr $C$DW$T$31, DW_AT_name("xLIST")
    2119                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x14)
    2120                    $C$DW$117       .dwtag  DW_TAG_member
    2121                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$22)
    2122                            .dwattr $C$DW$117, DW_AT_name("uxNumberOfItems")
    2123                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("uxNumberOfItems")
    2124                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2125                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2126                            .dwattr $C$DW$117, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2127                            .dwattr $C$DW$117, DW_AT_decl_line(0x9f)
    2128                            .dwattr $C$DW$117, DW_AT_decl_column(0x22)
    2129                    $C$DW$118       .dwtag  DW_TAG_member
    2130                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$29)
    2131                            .dwattr $C$DW$118, DW_AT_name("pxIndex")
    2132                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("pxIndex")
    2133                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2134                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   40

    2135                            .dwattr $C$DW$118, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2136                            .dwattr $C$DW$118, DW_AT_decl_line(0xa0)
    2137                            .dwattr $C$DW$118, DW_AT_decl_column(0x23)
    2138                    $C$DW$119       .dwtag  DW_TAG_member
    2139                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$30)
    2140                            .dwattr $C$DW$119, DW_AT_name("xListEnd")
    2141                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("xListEnd")
    2142                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2143                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2144                            .dwattr $C$DW$119, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2145                            .dwattr $C$DW$119, DW_AT_decl_line(0xa1)
    2146                            .dwattr $C$DW$119, DW_AT_decl_column(0x11)
    2147                            .dwendtag $C$DW$T$31
    2148                    
    2149                            .dwattr $C$DW$T$31, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2150                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x9d)
    2151                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2152                    $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    2153                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$31)
    2154                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2155                            .dwattr $C$DW$T$63, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2156                            .dwattr $C$DW$T$63, DW_AT_decl_line(0xa2)
    2157                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2158                    $C$DW$T$90      .dwtag  DW_TAG_const_type
    2159                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$63)
    2160                    $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    2161                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    2162                            .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    2163                    $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    2164                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2165                            .dwattr $C$DW$T$64, DW_AT_address_class(0x20)
    2166                    $C$DW$T$65      .dwtag  DW_TAG_const_type
    2167                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2168                    
    2169                    $C$DW$T$138     .dwtag  DW_TAG_array_type
    2170                            .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$63)
    2171                            .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
    2172                            .dwattr $C$DW$T$138, DW_AT_byte_size(0x28)
    2173                    $C$DW$120       .dwtag  DW_TAG_subrange_type
    2174                            .dwattr $C$DW$120, DW_AT_upper_bound(0x01)
    2175                            .dwendtag $C$DW$T$138
    2176                    
    2177                    
    2178                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2179                            .dwattr $C$DW$T$34, DW_AT_name("xLIST_ITEM")
    2180                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    2181                    $C$DW$121       .dwtag  DW_TAG_member
    2182                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$32)
    2183                            .dwattr $C$DW$121, DW_AT_name("xItemValue")
    2184                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("xItemValue")
    2185                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2187                            .dwattr $C$DW$121, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2188                            .dwattr $C$DW$121, DW_AT_decl_line(0x8a)
    2189                            .dwattr $C$DW$121, DW_AT_decl_column(0x21)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   41

    2190                    $C$DW$122       .dwtag  DW_TAG_member
    2191                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$33)
    2192                            .dwattr $C$DW$122, DW_AT_name("pxNext")
    2193                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("pxNext")
    2194                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2195                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2196                            .dwattr $C$DW$122, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2197                            .dwattr $C$DW$122, DW_AT_decl_line(0x8b)
    2198                            .dwattr $C$DW$122, DW_AT_decl_column(0x2a)
    2199                    $C$DW$123       .dwtag  DW_TAG_member
    2200                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$33)
    2201                            .dwattr $C$DW$123, DW_AT_name("pxPrevious")
    2202                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("pxPrevious")
    2203                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2204                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2205                            .dwattr $C$DW$123, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2206                            .dwattr $C$DW$123, DW_AT_decl_line(0x8c)
    2207                            .dwattr $C$DW$123, DW_AT_decl_column(0x2a)
    2208                    $C$DW$124       .dwtag  DW_TAG_member
    2209                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$3)
    2210                            .dwattr $C$DW$124, DW_AT_name("pvOwner")
    2211                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("pvOwner")
    2212                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2213                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2214                            .dwattr $C$DW$124, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2215                            .dwattr $C$DW$124, DW_AT_decl_line(0x8d)
    2216                            .dwattr $C$DW$124, DW_AT_decl_column(0x09)
    2217                    $C$DW$125       .dwtag  DW_TAG_member
    2218                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$3)
    2219                            .dwattr $C$DW$125, DW_AT_name("pvContainer")
    2220                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("pvContainer")
    2221                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2222                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2223                            .dwattr $C$DW$125, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2224                            .dwattr $C$DW$125, DW_AT_decl_line(0x8e)
    2225                            .dwattr $C$DW$125, DW_AT_decl_column(0x1d)
    2226                            .dwendtag $C$DW$T$34
    2227                    
    2228                            .dwattr $C$DW$T$34, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2229                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x88)
    2230                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x08)
    2231                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    2232                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$34)
    2233                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2234                            .dwattr $C$DW$T$26, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2235                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x90)
    2236                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1b)
    2237                    $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2238                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    2239                            .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    2240                    $C$DW$T$68      .dwtag  DW_TAG_const_type
    2241                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$29)
    2242                    $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2243                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$34)
    2244                            .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   42

    2245                    
    2246                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2247                            .dwattr $C$DW$T$35, DW_AT_name("xMEMORY_REGION")
    2248                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    2249                    $C$DW$126       .dwtag  DW_TAG_member
    2250                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$3)
    2251                            .dwattr $C$DW$126, DW_AT_name("pvBaseAddress")
    2252                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("pvBaseAddress")
    2253                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2255                            .dwattr $C$DW$126, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2256                            .dwattr $C$DW$126, DW_AT_decl_line(0x83)
    2257                            .dwattr $C$DW$126, DW_AT_decl_column(0x08)
    2258                    $C$DW$127       .dwtag  DW_TAG_member
    2259                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
    2260                            .dwattr $C$DW$127, DW_AT_name("ulLengthInBytes")
    2261                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("ulLengthInBytes")
    2262                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2263                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2264                            .dwattr $C$DW$127, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2265                            .dwattr $C$DW$127, DW_AT_decl_line(0x84)
    2266                            .dwattr $C$DW$127, DW_AT_decl_column(0x0b)
    2267                    $C$DW$128       .dwtag  DW_TAG_member
    2268                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    2269                            .dwattr $C$DW$128, DW_AT_name("ulParameters")
    2270                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("ulParameters")
    2271                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2272                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2273                            .dwattr $C$DW$128, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2274                            .dwattr $C$DW$128, DW_AT_decl_line(0x85)
    2275                            .dwattr $C$DW$128, DW_AT_decl_column(0x0b)
    2276                            .dwendtag $C$DW$T$35
    2277                    
    2278                            .dwattr $C$DW$T$35, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    2279                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x81)
    2280                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2281                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    2282                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$35)
    2283                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2284                            .dwattr $C$DW$T$46, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    2285                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x86)
    2286                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    2287                    
    2288                    $C$DW$T$47      .dwtag  DW_TAG_array_type
    2289                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    2290                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2291                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
    2292                    $C$DW$129       .dwtag  DW_TAG_subrange_type
    2293                            .dwattr $C$DW$129, DW_AT_upper_bound(0x00)
    2294                            .dwendtag $C$DW$T$47
    2295                    
    2296                    
    2297                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2298                            .dwattr $C$DW$T$36, DW_AT_name("xMINI_LIST_ITEM")
    2299                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   43

    2300                    $C$DW$130       .dwtag  DW_TAG_member
    2301                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$32)
    2302                            .dwattr $C$DW$130, DW_AT_name("xItemValue")
    2303                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("xItemValue")
    2304                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2306                            .dwattr $C$DW$130, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2307                            .dwattr $C$DW$130, DW_AT_decl_line(0x94)
    2308                            .dwattr $C$DW$130, DW_AT_decl_column(0x21)
    2309                    $C$DW$131       .dwtag  DW_TAG_member
    2310                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$33)
    2311                            .dwattr $C$DW$131, DW_AT_name("pxNext")
    2312                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("pxNext")
    2313                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2314                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2315                            .dwattr $C$DW$131, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2316                            .dwattr $C$DW$131, DW_AT_decl_line(0x95)
    2317                            .dwattr $C$DW$131, DW_AT_decl_column(0x2a)
    2318                    $C$DW$132       .dwtag  DW_TAG_member
    2319                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$33)
    2320                            .dwattr $C$DW$132, DW_AT_name("pxPrevious")
    2321                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("pxPrevious")
    2322                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2323                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2324                            .dwattr $C$DW$132, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorH
    2325                            .dwattr $C$DW$132, DW_AT_decl_line(0x96)
    2326                            .dwattr $C$DW$132, DW_AT_decl_column(0x2a)
    2327                            .dwendtag $C$DW$T$36
    2328                    
    2329                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2330                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x92)
    2331                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x08)
    2332                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    2333                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$36)
    2334                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2335                            .dwattr $C$DW$T$30, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    2336                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x98)
    2337                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x20)
    2338                    
    2339                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2340                            .dwattr $C$DW$T$48, DW_AT_name("xTASK_PARAMETERS")
    2341                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x24)
    2342                    $C$DW$133       .dwtag  DW_TAG_member
    2343                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$39)
    2344                            .dwattr $C$DW$133, DW_AT_name("pvTaskCode")
    2345                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("pvTaskCode")
    2346                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2347                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2348                            .dwattr $C$DW$133, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2349                            .dwattr $C$DW$133, DW_AT_decl_line(0x8d)
    2350                            .dwattr $C$DW$133, DW_AT_decl_column(0x11)
    2351                    $C$DW$134       .dwtag  DW_TAG_member
    2352                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$43)
    2353                            .dwattr $C$DW$134, DW_AT_name("pcName")
    2354                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("pcName")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   44

    2355                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2356                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2357                            .dwattr $C$DW$134, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2358                            .dwattr $C$DW$134, DW_AT_decl_line(0x8e)
    2359                            .dwattr $C$DW$134, DW_AT_decl_column(0x15)
    2360                    $C$DW$135       .dwtag  DW_TAG_member
    2361                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$27)
    2362                            .dwattr $C$DW$135, DW_AT_name("usStackDepth")
    2363                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("usStackDepth")
    2364                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2365                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2366                            .dwattr $C$DW$135, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2367                            .dwattr $C$DW$135, DW_AT_decl_line(0x8f)
    2368                            .dwattr $C$DW$135, DW_AT_decl_column(0x0b)
    2369                    $C$DW$136       .dwtag  DW_TAG_member
    2370                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$3)
    2371                            .dwattr $C$DW$136, DW_AT_name("pvParameters")
    2372                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("pvParameters")
    2373                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2374                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2375                            .dwattr $C$DW$136, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2376                            .dwattr $C$DW$136, DW_AT_decl_line(0x90)
    2377                            .dwattr $C$DW$136, DW_AT_decl_column(0x08)
    2378                    $C$DW$137       .dwtag  DW_TAG_member
    2379                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    2380                            .dwattr $C$DW$137, DW_AT_name("uxPriority")
    2381                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("uxPriority")
    2382                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2383                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2384                            .dwattr $C$DW$137, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2385                            .dwattr $C$DW$137, DW_AT_decl_line(0x91)
    2386                            .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2387                    $C$DW$138       .dwtag  DW_TAG_member
    2388                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$45)
    2389                            .dwattr $C$DW$138, DW_AT_name("puxStackBuffer")
    2390                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("puxStackBuffer")
    2391                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2392                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2393                            .dwattr $C$DW$138, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2394                            .dwattr $C$DW$138, DW_AT_decl_line(0x92)
    2395                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2396                    $C$DW$139       .dwtag  DW_TAG_member
    2397                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$47)
    2398                            .dwattr $C$DW$139, DW_AT_name("xRegions")
    2399                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("xRegions")
    2400                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2401                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2402                            .dwattr $C$DW$139, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2403                            .dwattr $C$DW$139, DW_AT_decl_line(0x93)
    2404                            .dwattr $C$DW$139, DW_AT_decl_column(0x11)
    2405                            .dwendtag $C$DW$T$48
    2406                    
    2407                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    2408                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x8b)
    2409                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   45

    2410                    $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("TaskParameters_t")
    2411                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$48)
    2412                            .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    2413                            .dwattr $C$DW$T$142, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Senso
    2414                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x94)
    2415                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x03)
    2416                    
    2417                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2418                            .dwattr $C$DW$T$52, DW_AT_name("xTASK_STATUS")
    2419                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x20)
    2420                    $C$DW$140       .dwtag  DW_TAG_member
    2421                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$49)
    2422                            .dwattr $C$DW$140, DW_AT_name("xHandle")
    2423                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("xHandle")
    2424                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2425                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2426                            .dwattr $C$DW$140, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2427                            .dwattr $C$DW$140, DW_AT_decl_line(0x9a)
    2428                            .dwattr $C$DW$140, DW_AT_decl_column(0x0f)
    2429                    $C$DW$141       .dwtag  DW_TAG_member
    2430                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$42)
    2431                            .dwattr $C$DW$141, DW_AT_name("pcTaskName")
    2432                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("pcTaskName")
    2433                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2434                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2435                            .dwattr $C$DW$141, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2436                            .dwattr $C$DW$141, DW_AT_decl_line(0x9b)
    2437                            .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2438                    $C$DW$142       .dwtag  DW_TAG_member
    2439                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$22)
    2440                            .dwattr $C$DW$142, DW_AT_name("xTaskNumber")
    2441                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("xTaskNumber")
    2442                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2443                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2444                            .dwattr $C$DW$142, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2445                            .dwattr $C$DW$142, DW_AT_decl_line(0x9c)
    2446                            .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2447                    $C$DW$143       .dwtag  DW_TAG_member
    2448                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$51)
    2449                            .dwattr $C$DW$143, DW_AT_name("eCurrentState")
    2450                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("eCurrentState")
    2451                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2452                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2453                            .dwattr $C$DW$143, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2454                            .dwattr $C$DW$143, DW_AT_decl_line(0x9d)
    2455                            .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    2456                    $C$DW$144       .dwtag  DW_TAG_member
    2457                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$22)
    2458                            .dwattr $C$DW$144, DW_AT_name("uxCurrentPriority")
    2459                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("uxCurrentPriority")
    2460                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2461                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2462                            .dwattr $C$DW$144, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2463                            .dwattr $C$DW$144, DW_AT_decl_line(0x9e)
    2464                            .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   46

    2465                    $C$DW$145       .dwtag  DW_TAG_member
    2466                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    2467                            .dwattr $C$DW$145, DW_AT_name("uxBasePriority")
    2468                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("uxBasePriority")
    2469                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2470                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2471                            .dwattr $C$DW$145, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2472                            .dwattr $C$DW$145, DW_AT_decl_line(0x9f)
    2473                            .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2474                    $C$DW$146       .dwtag  DW_TAG_member
    2475                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    2476                            .dwattr $C$DW$146, DW_AT_name("ulRunTimeCounter")
    2477                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("ulRunTimeCounter")
    2478                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2479                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2480                            .dwattr $C$DW$146, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2481                            .dwattr $C$DW$146, DW_AT_decl_line(0xa0)
    2482                            .dwattr $C$DW$146, DW_AT_decl_column(0x0b)
    2483                    $C$DW$147       .dwtag  DW_TAG_member
    2484                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2485                            .dwattr $C$DW$147, DW_AT_name("usStackHighWaterMark")
    2486                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("usStackHighWaterMark")
    2487                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2488                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2489                            .dwattr $C$DW$147, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2490                            .dwattr $C$DW$147, DW_AT_decl_line(0xa1)
    2491                            .dwattr $C$DW$147, DW_AT_decl_column(0x0b)
    2492                            .dwendtag $C$DW$T$52
    2493                    
    2494                            .dwattr $C$DW$T$52, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    2495                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x98)
    2496                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    2497                    $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("TaskStatus_t")
    2498                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$52)
    2499                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    2500                            .dwattr $C$DW$T$143, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Senso
    2501                            .dwattr $C$DW$T$143, DW_AT_decl_line(0xa2)
    2502                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x03)
    2503                    
    2504                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2505                            .dwattr $C$DW$T$55, DW_AT_name("xTIME_OUT")
    2506                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    2507                    $C$DW$148       .dwtag  DW_TAG_member
    2508                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$54)
    2509                            .dwattr $C$DW$148, DW_AT_name("xOverflowCount")
    2510                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("xOverflowCount")
    2511                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2513                            .dwattr $C$DW$148, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2514                            .dwattr $C$DW$148, DW_AT_decl_line(0x7a)
    2515                            .dwattr $C$DW$148, DW_AT_decl_column(0x0d)
    2516                    $C$DW$149       .dwtag  DW_TAG_member
    2517                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$32)
    2518                            .dwattr $C$DW$149, DW_AT_name("xTimeOnEntering")
    2519                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("xTimeOnEntering")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   47

    2520                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2521                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2522                            .dwattr $C$DW$149, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorH
    2523                            .dwattr $C$DW$149, DW_AT_decl_line(0x7b)
    2524                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2525                            .dwendtag $C$DW$T$55
    2526                    
    2527                            .dwattr $C$DW$T$55, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    2528                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x78)
    2529                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    2530                    $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    2531                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$55)
    2532                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    2533                            .dwattr $C$DW$T$144, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Senso
    2534                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x7c)
    2535                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x03)
    2536                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2537                    
    2538                    ;***************************************************************
    2539                    ;* DWARF CIE ENTRIES                                           *
    2540                    ;***************************************************************
    2541                    
    2542                    $C$DW$CIE       .dwcie 14
    2543                            .dwcfi  cfa_register, 13
    2544                            .dwcfi  cfa_offset, 0
    2545                            .dwcfi  undefined, 0
    2546                            .dwcfi  undefined, 1
    2547                            .dwcfi  undefined, 2
    2548                            .dwcfi  undefined, 3
    2549                            .dwcfi  same_value, 4
    2550                            .dwcfi  same_value, 5
    2551                            .dwcfi  same_value, 6
    2552                            .dwcfi  same_value, 7
    2553                            .dwcfi  same_value, 8
    2554                            .dwcfi  same_value, 9
    2555                            .dwcfi  same_value, 10
    2556                            .dwcfi  same_value, 11
    2557                            .dwcfi  undefined, 12
    2558                            .dwcfi  undefined, 13
    2559                            .dwcfi  undefined, 14
    2560                            .dwcfi  undefined, 14
    2561                            .dwcfi  undefined, 7
    2562                            .dwcfi  undefined, 64
    2563                            .dwcfi  undefined, 65
    2564                            .dwcfi  undefined, 66
    2565                            .dwcfi  undefined, 67
    2566                            .dwcfi  undefined, 68
    2567                            .dwcfi  undefined, 69
    2568                            .dwcfi  undefined, 70
    2569                            .dwcfi  undefined, 71
    2570                            .dwcfi  undefined, 72
    2571                            .dwcfi  undefined, 73
    2572                            .dwcfi  undefined, 74
    2573                            .dwcfi  undefined, 75
    2574                            .dwcfi  undefined, 76
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:37 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   48

    2575                            .dwcfi  undefined, 77
