TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.7 *
       3                    ;* Date/Time created: Tue Sep 16 08:38:44 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --disable_dual_state --
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/portable/CCS5/ARM_CM3/port.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.7 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHub
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ulPortSetInterruptMask")

    1116                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x33)
    1117                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x20)
    1118                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    1119                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    1120                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    1121                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1122                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x4f)
    1123                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x16)
    1124                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    1125                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$107)
    1126                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    1127                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1128                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x41)
    1129                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x16)
    1130                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    1131                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$15)
    1132                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    1133                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1134                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x57)
    1135                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x20)
    1136                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1137                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1138                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1139                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1140                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("portFLOAT")
    1141                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$16)
    1142                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    1143                            .dwattr $C$DW$T$111, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Senso
    1144                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x62)
    1145                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x10)
    1146                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1147                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1148                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1149                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1150                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1151                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1152                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1153                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1154                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("_Sysch_t")
    1155                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$6)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   22

    1156                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    1157                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1158                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x23a)
    1159                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x0e)
    1160                    $C$DW$T$35      .dwtag  DW_TAG_const_type
    1161                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$6)
    1162                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1163                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1164                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    1165                    $C$DW$T$37      .dwtag  DW_TAG_const_type
    1166                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1167                    $C$DW$T$113     .dwtag  DW_TAG_pointer_type
    1168                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$6)
    1169                            .dwattr $C$DW$T$113, DW_AT_address_class(0x20)
    1170                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("__builtin_va_list")
    1171                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    1172                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    1173                            .dwattr $C$DW$T$114, DW_AT_decl_file("../Source/portable/CCS5/ARM_CM3/port.c")
    1174                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x1a9)
    1175                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x01)
    1176                    
    1177                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1178                            .dwattr $C$DW$T$19, DW_AT_name("__va_list")
    1179                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1180                    $C$DW$47        .dwtag  DW_TAG_member
    1181                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$3)
    1182                            .dwattr $C$DW$47, DW_AT_name("__ap")
    1183                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("__ap")
    1184                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1186                            .dwattr $C$DW$47, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/s
    1187                            .dwattr $C$DW$47, DW_AT_decl_line(0x32)
    1188                            .dwattr $C$DW$47, DW_AT_decl_column(0x0c)
    1189                            .dwendtag $C$DW$T$19
    1190                    
    1191                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    1192                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x31)
    1193                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1194                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    1195                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$19)
    1196                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    1197                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1198                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x33)
    1199                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x03)
    1200                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("_Va_list")
    1201                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$115)
    1202                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    1203                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    1204                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x218)
    1205                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x17)
    1206                    
    1207                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1208                            .dwattr $C$DW$T$25, DW_AT_name("xLIST")
    1209                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
    1210                    $C$DW$48        .dwtag  DW_TAG_member
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   23

    1211                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$21)
    1212                            .dwattr $C$DW$48, DW_AT_name("uxNumberOfItems")
    1213                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("uxNumberOfItems")
    1214                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1216                            .dwattr $C$DW$48, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1217                            .dwattr $C$DW$48, DW_AT_decl_line(0x9f)
    1218                            .dwattr $C$DW$48, DW_AT_decl_column(0x22)
    1219                    $C$DW$49        .dwtag  DW_TAG_member
    1220                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$23)
    1221                            .dwattr $C$DW$49, DW_AT_name("pxIndex")
    1222                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("pxIndex")
    1223                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1224                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1225                            .dwattr $C$DW$49, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1226                            .dwattr $C$DW$49, DW_AT_decl_line(0xa0)
    1227                            .dwattr $C$DW$49, DW_AT_decl_column(0x23)
    1228                    $C$DW$50        .dwtag  DW_TAG_member
    1229                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$24)
    1230                            .dwattr $C$DW$50, DW_AT_name("xListEnd")
    1231                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("xListEnd")
    1232                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1233                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1234                            .dwattr $C$DW$50, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1235                            .dwattr $C$DW$50, DW_AT_decl_line(0xa1)
    1236                            .dwattr $C$DW$50, DW_AT_decl_column(0x11)
    1237                            .dwendtag $C$DW$T$25
    1238                    
    1239                            .dwattr $C$DW$T$25, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    1240                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x9d)
    1241                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1242                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    1243                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$25)
    1244                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    1245                            .dwattr $C$DW$T$117, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Senso
    1246                            .dwattr $C$DW$T$117, DW_AT_decl_line(0xa2)
    1247                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x03)
    1248                    
    1249                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1250                            .dwattr $C$DW$T$28, DW_AT_name("xLIST_ITEM")
    1251                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x14)
    1252                    $C$DW$51        .dwtag  DW_TAG_member
    1253                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$26)
    1254                            .dwattr $C$DW$51, DW_AT_name("xItemValue")
    1255                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("xItemValue")
    1256                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1258                            .dwattr $C$DW$51, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1259                            .dwattr $C$DW$51, DW_AT_decl_line(0x8a)
    1260                            .dwattr $C$DW$51, DW_AT_decl_column(0x21)
    1261                    $C$DW$52        .dwtag  DW_TAG_member
    1262                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$27)
    1263                            .dwattr $C$DW$52, DW_AT_name("pxNext")
    1264                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("pxNext")
    1265                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   24

    1266                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1267                            .dwattr $C$DW$52, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1268                            .dwattr $C$DW$52, DW_AT_decl_line(0x8b)
    1269                            .dwattr $C$DW$52, DW_AT_decl_column(0x2a)
    1270                    $C$DW$53        .dwtag  DW_TAG_member
    1271                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$27)
    1272                            .dwattr $C$DW$53, DW_AT_name("pxPrevious")
    1273                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("pxPrevious")
    1274                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1275                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1276                            .dwattr $C$DW$53, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1277                            .dwattr $C$DW$53, DW_AT_decl_line(0x8c)
    1278                            .dwattr $C$DW$53, DW_AT_decl_column(0x2a)
    1279                    $C$DW$54        .dwtag  DW_TAG_member
    1280                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$3)
    1281                            .dwattr $C$DW$54, DW_AT_name("pvOwner")
    1282                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("pvOwner")
    1283                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1284                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1285                            .dwattr $C$DW$54, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1286                            .dwattr $C$DW$54, DW_AT_decl_line(0x8d)
    1287                            .dwattr $C$DW$54, DW_AT_decl_column(0x09)
    1288                    $C$DW$55        .dwtag  DW_TAG_member
    1289                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$3)
    1290                            .dwattr $C$DW$55, DW_AT_name("pvContainer")
    1291                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("pvContainer")
    1292                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1293                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1294                            .dwattr $C$DW$55, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1295                            .dwattr $C$DW$55, DW_AT_decl_line(0x8e)
    1296                            .dwattr $C$DW$55, DW_AT_decl_column(0x1d)
    1297                            .dwendtag $C$DW$T$28
    1298                    
    1299                            .dwattr $C$DW$T$28, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    1300                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x88)
    1301                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x08)
    1302                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    1303                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$28)
    1304                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1305                            .dwattr $C$DW$T$22, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    1306                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x90)
    1307                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x1b)
    1308                    $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    1309                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1310                            .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
    1311                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1312                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$28)
    1313                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    1314                    
    1315                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1316                            .dwattr $C$DW$T$29, DW_AT_name("xMEMORY_REGION")
    1317                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x0c)
    1318                    $C$DW$56        .dwtag  DW_TAG_member
    1319                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$3)
    1320                            .dwattr $C$DW$56, DW_AT_name("pvBaseAddress")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   25

    1321                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("pvBaseAddress")
    1322                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1324                            .dwattr $C$DW$56, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1325                            .dwattr $C$DW$56, DW_AT_decl_line(0x83)
    1326                            .dwattr $C$DW$56, DW_AT_decl_column(0x08)
    1327                    $C$DW$57        .dwtag  DW_TAG_member
    1328                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
    1329                            .dwattr $C$DW$57, DW_AT_name("ulLengthInBytes")
    1330                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("ulLengthInBytes")
    1331                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1332                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1333                            .dwattr $C$DW$57, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1334                            .dwattr $C$DW$57, DW_AT_decl_line(0x84)
    1335                            .dwattr $C$DW$57, DW_AT_decl_column(0x0b)
    1336                    $C$DW$58        .dwtag  DW_TAG_member
    1337                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
    1338                            .dwattr $C$DW$58, DW_AT_name("ulParameters")
    1339                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("ulParameters")
    1340                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1341                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1342                            .dwattr $C$DW$58, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1343                            .dwattr $C$DW$58, DW_AT_decl_line(0x85)
    1344                            .dwattr $C$DW$58, DW_AT_decl_column(0x0b)
    1345                            .dwendtag $C$DW$T$29
    1346                    
    1347                            .dwattr $C$DW$T$29, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    1348                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x81)
    1349                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    1350                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    1351                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$29)
    1352                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1353                            .dwattr $C$DW$T$41, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    1354                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x86)
    1355                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    1356                    
    1357                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    1358                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1359                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1360                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
    1361                    $C$DW$59        .dwtag  DW_TAG_subrange_type
    1362                            .dwattr $C$DW$59, DW_AT_upper_bound(0x00)
    1363                            .dwendtag $C$DW$T$42
    1364                    
    1365                    
    1366                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1367                            .dwattr $C$DW$T$30, DW_AT_name("xMINI_LIST_ITEM")
    1368                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
    1369                    $C$DW$60        .dwtag  DW_TAG_member
    1370                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$26)
    1371                            .dwattr $C$DW$60, DW_AT_name("xItemValue")
    1372                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("xItemValue")
    1373                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1374                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1375                            .dwattr $C$DW$60, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   26

    1376                            .dwattr $C$DW$60, DW_AT_decl_line(0x94)
    1377                            .dwattr $C$DW$60, DW_AT_decl_column(0x21)
    1378                    $C$DW$61        .dwtag  DW_TAG_member
    1379                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$27)
    1380                            .dwattr $C$DW$61, DW_AT_name("pxNext")
    1381                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("pxNext")
    1382                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1383                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1384                            .dwattr $C$DW$61, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1385                            .dwattr $C$DW$61, DW_AT_decl_line(0x95)
    1386                            .dwattr $C$DW$61, DW_AT_decl_column(0x2a)
    1387                    $C$DW$62        .dwtag  DW_TAG_member
    1388                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$27)
    1389                            .dwattr $C$DW$62, DW_AT_name("pxPrevious")
    1390                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("pxPrevious")
    1391                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1392                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1393                            .dwattr $C$DW$62, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHu
    1394                            .dwattr $C$DW$62, DW_AT_decl_line(0x96)
    1395                            .dwattr $C$DW$62, DW_AT_decl_column(0x2a)
    1396                            .dwendtag $C$DW$T$30
    1397                    
    1398                            .dwattr $C$DW$T$30, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    1399                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x92)
    1400                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x08)
    1401                    $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    1402                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$30)
    1403                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1404                            .dwattr $C$DW$T$24, DW_AT_decl_file("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_Sensor
    1405                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x98)
    1406                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x20)
    1407                    
    1408                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1409                            .dwattr $C$DW$T$43, DW_AT_name("xTASK_PARAMETERS")
    1410                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x24)
    1411                    $C$DW$63        .dwtag  DW_TAG_member
    1412                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$33)
    1413                            .dwattr $C$DW$63, DW_AT_name("pvTaskCode")
    1414                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("pvTaskCode")
    1415                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1417                            .dwattr $C$DW$63, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1418                            .dwattr $C$DW$63, DW_AT_decl_line(0x8d)
    1419                            .dwattr $C$DW$63, DW_AT_decl_column(0x11)
    1420                    $C$DW$64        .dwtag  DW_TAG_member
    1421                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$37)
    1422                            .dwattr $C$DW$64, DW_AT_name("pcName")
    1423                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("pcName")
    1424                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1425                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1426                            .dwattr $C$DW$64, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1427                            .dwattr $C$DW$64, DW_AT_decl_line(0x8e)
    1428                            .dwattr $C$DW$64, DW_AT_decl_column(0x15)
    1429                    $C$DW$65        .dwtag  DW_TAG_member
    1430                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$38)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   27

    1431                            .dwattr $C$DW$65, DW_AT_name("usStackDepth")
    1432                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("usStackDepth")
    1433                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1434                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1435                            .dwattr $C$DW$65, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1436                            .dwattr $C$DW$65, DW_AT_decl_line(0x8f)
    1437                            .dwattr $C$DW$65, DW_AT_decl_column(0x0b)
    1438                    $C$DW$66        .dwtag  DW_TAG_member
    1439                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$3)
    1440                            .dwattr $C$DW$66, DW_AT_name("pvParameters")
    1441                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("pvParameters")
    1442                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1443                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1444                            .dwattr $C$DW$66, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1445                            .dwattr $C$DW$66, DW_AT_decl_line(0x90)
    1446                            .dwattr $C$DW$66, DW_AT_decl_column(0x08)
    1447                    $C$DW$67        .dwtag  DW_TAG_member
    1448                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
    1449                            .dwattr $C$DW$67, DW_AT_name("uxPriority")
    1450                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("uxPriority")
    1451                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1452                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1453                            .dwattr $C$DW$67, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1454                            .dwattr $C$DW$67, DW_AT_decl_line(0x91)
    1455                            .dwattr $C$DW$67, DW_AT_decl_column(0x0e)
    1456                    $C$DW$68        .dwtag  DW_TAG_member
    1457                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$40)
    1458                            .dwattr $C$DW$68, DW_AT_name("puxStackBuffer")
    1459                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("puxStackBuffer")
    1460                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1461                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1462                            .dwattr $C$DW$68, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1463                            .dwattr $C$DW$68, DW_AT_decl_line(0x92)
    1464                            .dwattr $C$DW$68, DW_AT_decl_column(0x0f)
    1465                    $C$DW$69        .dwtag  DW_TAG_member
    1466                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$42)
    1467                            .dwattr $C$DW$69, DW_AT_name("xRegions")
    1468                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("xRegions")
    1469                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1470                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1471                            .dwattr $C$DW$69, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1472                            .dwattr $C$DW$69, DW_AT_decl_line(0x93)
    1473                            .dwattr $C$DW$69, DW_AT_decl_column(0x11)
    1474                            .dwendtag $C$DW$T$43
    1475                    
    1476                            .dwattr $C$DW$T$43, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    1477                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x8b)
    1478                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    1479                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("TaskParameters_t")
    1480                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$43)
    1481                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    1482                            .dwattr $C$DW$T$118, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Senso
    1483                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x94)
    1484                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x03)
    1485                    
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   28

    1486                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1487                            .dwattr $C$DW$T$47, DW_AT_name("xTASK_STATUS")
    1488                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x20)
    1489                    $C$DW$70        .dwtag  DW_TAG_member
    1490                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$44)
    1491                            .dwattr $C$DW$70, DW_AT_name("xHandle")
    1492                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("xHandle")
    1493                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1495                            .dwattr $C$DW$70, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1496                            .dwattr $C$DW$70, DW_AT_decl_line(0x9a)
    1497                            .dwattr $C$DW$70, DW_AT_decl_column(0x0f)
    1498                    $C$DW$71        .dwtag  DW_TAG_member
    1499                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$36)
    1500                            .dwattr $C$DW$71, DW_AT_name("pcTaskName")
    1501                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("pcTaskName")
    1502                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1503                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1504                            .dwattr $C$DW$71, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1505                            .dwattr $C$DW$71, DW_AT_decl_line(0x9b)
    1506                            .dwattr $C$DW$71, DW_AT_decl_column(0x0e)
    1507                    $C$DW$72        .dwtag  DW_TAG_member
    1508                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
    1509                            .dwattr $C$DW$72, DW_AT_name("xTaskNumber")
    1510                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("xTaskNumber")
    1511                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1512                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$72, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1514                            .dwattr $C$DW$72, DW_AT_decl_line(0x9c)
    1515                            .dwattr $C$DW$72, DW_AT_decl_column(0x0e)
    1516                    $C$DW$73        .dwtag  DW_TAG_member
    1517                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$46)
    1518                            .dwattr $C$DW$73, DW_AT_name("eCurrentState")
    1519                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("eCurrentState")
    1520                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1521                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1522                            .dwattr $C$DW$73, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1523                            .dwattr $C$DW$73, DW_AT_decl_line(0x9d)
    1524                            .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1525                    $C$DW$74        .dwtag  DW_TAG_member
    1526                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1527                            .dwattr $C$DW$74, DW_AT_name("uxCurrentPriority")
    1528                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("uxCurrentPriority")
    1529                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1530                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1531                            .dwattr $C$DW$74, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1532                            .dwattr $C$DW$74, DW_AT_decl_line(0x9e)
    1533                            .dwattr $C$DW$74, DW_AT_decl_column(0x0e)
    1534                    $C$DW$75        .dwtag  DW_TAG_member
    1535                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    1536                            .dwattr $C$DW$75, DW_AT_name("uxBasePriority")
    1537                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("uxBasePriority")
    1538                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1539                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1540                            .dwattr $C$DW$75, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   29

    1541                            .dwattr $C$DW$75, DW_AT_decl_line(0x9f)
    1542                            .dwattr $C$DW$75, DW_AT_decl_column(0x0e)
    1543                    $C$DW$76        .dwtag  DW_TAG_member
    1544                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1545                            .dwattr $C$DW$76, DW_AT_name("ulRunTimeCounter")
    1546                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("ulRunTimeCounter")
    1547                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1548                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1549                            .dwattr $C$DW$76, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1550                            .dwattr $C$DW$76, DW_AT_decl_line(0xa0)
    1551                            .dwattr $C$DW$76, DW_AT_decl_column(0x0b)
    1552                    $C$DW$77        .dwtag  DW_TAG_member
    1553                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$38)
    1554                            .dwattr $C$DW$77, DW_AT_name("usStackHighWaterMark")
    1555                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("usStackHighWaterMark")
    1556                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1557                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1558                            .dwattr $C$DW$77, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1559                            .dwattr $C$DW$77, DW_AT_decl_line(0xa1)
    1560                            .dwattr $C$DW$77, DW_AT_decl_column(0x0b)
    1561                            .dwendtag $C$DW$T$47
    1562                    
    1563                            .dwattr $C$DW$T$47, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    1564                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x98)
    1565                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    1566                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("TaskStatus_t")
    1567                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$47)
    1568                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    1569                            .dwattr $C$DW$T$119, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Senso
    1570                            .dwattr $C$DW$T$119, DW_AT_decl_line(0xa2)
    1571                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x03)
    1572                    
    1573                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1574                            .dwattr $C$DW$T$50, DW_AT_name("xTIME_OUT")
    1575                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    1576                    $C$DW$78        .dwtag  DW_TAG_member
    1577                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$49)
    1578                            .dwattr $C$DW$78, DW_AT_name("xOverflowCount")
    1579                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("xOverflowCount")
    1580                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1582                            .dwattr $C$DW$78, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1583                            .dwattr $C$DW$78, DW_AT_decl_line(0x7a)
    1584                            .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1585                    $C$DW$79        .dwtag  DW_TAG_member
    1586                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$26)
    1587                            .dwattr $C$DW$79, DW_AT_name("xTimeOnEntering")
    1588                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("xTimeOnEntering")
    1589                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1590                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1591                            .dwattr $C$DW$79, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_SensorHu
    1592                            .dwattr $C$DW$79, DW_AT_decl_line(0x7b)
    1593                            .dwattr $C$DW$79, DW_AT_decl_column(0x0e)
    1594                            .dwendtag $C$DW$T$50
    1595                    
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:44 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   30

    1596                            .dwattr $C$DW$T$50, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Sensor
    1597                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x78)
    1598                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    1599                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    1600                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$50)
    1601                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    1602                            .dwattr $C$DW$T$120, DW_AT_decl_file("H:/class/690 Adv. Emb. Sys/FreeRTOS8_EECS_TM4C1294_Senso
    1603                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x7c)
    1604                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x03)
    1605                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1606                    
    1607                    ;***************************************************************
    1608                    ;* DWARF CIE ENTRIES                                           *
    1609                    ;***************************************************************
    1610                    
    1611                    $C$DW$CIE       .dwcie 14
    1612                            .dwcfi  cfa_register, 13
    1613                            .dwcfi  cfa_offset, 0
    1614                            .dwcfi  undefined, 0
    1615                            .dwcfi  undefined, 1
    1616                            .dwcfi  undefined, 2
    1617                            .dwcfi  undefined, 3
    1618                            .dwcfi  same_value, 4
    1619                            .dwcfi  same_value, 5
    1620                            .dwcfi  same_value, 6
    1621                            .dwcfi  same_value, 7
    1622                            .dwcfi  same_value, 8
    1623                            .dwcfi  same_value, 9
    1624                            .dwcfi  same_value, 10
    1625                            .dwcfi  same_value, 11
    1626                            .dwcfi  undefined, 12
    1627                            .dwcfi  undefined, 13
    1628                            .dwcfi  undefined, 14
    1629                            .dwcfi  undefined, 14
    1630                            .dwcfi  undefined, 7
    1631                            .dwcfi  undefined, 64
    1632                            .dwcfi  undefined, 65
    1633                            .dwcfi  undefined, 66
    1634                            .dwcfi  undefined, 67
    1635                            .dwcfi  undefined, 68
    1636                            .dwcfi  undefined, 69
    1637                            .dwcfi  undefined, 70
    1638                            .dwcfi  undefined, 71
    1639                            .dwcfi  undefined, 72
    1640                            .dwcfi  undefined, 73
    1641                            .dwcfi  undefined, 74
    1642                            .dwcfi  undefined, 75
    1643                            .dwcfi  undefined, 76
    1644                            .dwcfi  undefined, 77
