TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.7 *
       3                    ;* Date/Time created: Tue Sep 16 08:38:45 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --disable_dual_state --
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Drivers/i2cm_drv.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.7 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\class\690 Adv. Emb. Sys\FreeRTOS8_EECS_TM4C1294_SensorHub
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("I2CMasterControl")

    5326                            .dwattr $C$DW$381, DW_AT_TI_end_file("../Drivers/i2cm_drv.c")
    5327                            .dwattr $C$DW$381, DW_AT_TI_end_line(0x8d2)
    5328                            .dwattr $C$DW$381, DW_AT_TI_end_column(0x01)
    5329                            .dwendentry
    5330                            .dwendtag $C$DW$381
    5331                    
    5332                    ;******************************************************************************
    5333                    ;* CONSTANT TABLE                                                             *
    5334                    ;******************************************************************************
    5335 00000bec                   .sect   ".text"
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE   98

    5336                            .align  4
    5337 00000bec 00000000! ||$C$CON4||:    .bits   I2CMWrite8Callback,32
    5338                            .align  4
    5339 00000bf0 00000000! ||$C$CON5||:    .bits   I2CMRead16BECallback,32
    5340                            .align  4
    5341 00000bf4 00000000! ||$C$CON6||:    .bits   I2CMWrite16BECallback,32
    5342                    ;*****************************************************************************
    5343                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    5344                    ;*****************************************************************************
    5345                            .global I2CMasterControl
    5346                            .global I2CMasterDataGet
    5347                            .global I2CMasterDataPut
    5348                            .global I2CMasterInitExpClk
    5349                            .global I2CMasterIntClear
    5350                            .global I2CMasterIntEnableEx
    5351                            .global I2CMasterSlaveAddrSet
    5352                            .global IntEnable
    5353                            .global IntDisable
    5354                            .global IntIsEnabled
    5355                            .global IntTrigger
    5356                            .global ui32I2C7HWStatus
    5357                    ;*****************************************************************************
    5358                    ;* SECTION GROUPS                                                            *
    5359                    ;*****************************************************************************
    5360                            .group    "I2CMRead", 1
    5361                            .gmember  ".text:I2CMRead"
    5362                            .endgroup
    5363                            .group    "I2CMReadBatched", 1
    5364                            .gmember  ".text:I2CMReadBatched"
    5365                            .endgroup
    5366                            .group    "I2CMReadModifyWrite16BE", 1
    5367                            .gmember  ".text:I2CMReadModifyWrite16BE"
    5368                            .endgroup
    5369                            .group    "I2CMWrite", 1
    5370                            .gmember  ".text:I2CMWrite"
    5371                            .endgroup
    5372                            .group    "I2CMWriteBatched", 1
    5373                            .gmember  ".text:I2CMWriteBatched"
    5374                            .endgroup
    5375                    
    5376                    
    5377                    ;******************************************************************************
    5378                    ;* BUILD ATTRIBUTES                                                           *
    5379                    ;******************************************************************************
    5380                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
    5381                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
    5382                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    5383                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    5384                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    5385                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
    5386                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
    5387                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    5388                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
    5389                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    5390                    
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE   99

    5391                    ;******************************************************************************
    5392                    ;* TYPE INFORMATION                                                           *
    5393                    ;******************************************************************************
    5394                    
    5395                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5396                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    5397                    $C$DW$396       .dwtag  DW_TAG_member
    5398                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    5399                            .dwattr $C$DW$396, DW_AT_name("ui8Addr")
    5400                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("ui8Addr")
    5401                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5402                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    5403                            .dwattr $C$DW$396, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5404                            .dwattr $C$DW$396, DW_AT_decl_line(0x4c)
    5405                            .dwattr $C$DW$396, DW_AT_decl_column(0x0d)
    5406                    $C$DW$397       .dwtag  DW_TAG_member
    5407                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
    5408                            .dwattr $C$DW$397, DW_AT_name("pui8WriteData")
    5409                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("pui8WriteData")
    5410                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5411                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    5412                            .dwattr $C$DW$397, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5413                            .dwattr $C$DW$397, DW_AT_decl_line(0x51)
    5414                            .dwattr $C$DW$397, DW_AT_decl_column(0x14)
    5415                    $C$DW$398       .dwtag  DW_TAG_member
    5416                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$22)
    5417                            .dwattr $C$DW$398, DW_AT_name("ui16WriteCount")
    5418                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("ui16WriteCount")
    5419                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5420                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    5421                            .dwattr $C$DW$398, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5422                            .dwattr $C$DW$398, DW_AT_decl_line(0x56)
    5423                            .dwattr $C$DW$398, DW_AT_decl_column(0x0e)
    5424                    $C$DW$399       .dwtag  DW_TAG_member
    5425                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$22)
    5426                            .dwattr $C$DW$399, DW_AT_name("ui16WriteBatchSize")
    5427                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    5428                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5429                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    5430                            .dwattr $C$DW$399, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5431                            .dwattr $C$DW$399, DW_AT_decl_line(0x5b)
    5432                            .dwattr $C$DW$399, DW_AT_decl_column(0x0e)
    5433                    $C$DW$400       .dwtag  DW_TAG_member
    5434                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$23)
    5435                            .dwattr $C$DW$400, DW_AT_name("pui8ReadData")
    5436                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("pui8ReadData")
    5437                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5438                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5439                            .dwattr $C$DW$400, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5440                            .dwattr $C$DW$400, DW_AT_decl_line(0x60)
    5441                            .dwattr $C$DW$400, DW_AT_decl_column(0x0e)
    5442                    $C$DW$401       .dwtag  DW_TAG_member
    5443                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$22)
    5444                            .dwattr $C$DW$401, DW_AT_name("ui16ReadCount")
    5445                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("ui16ReadCount")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  100

    5446                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5447                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    5448                            .dwattr $C$DW$401, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5449                            .dwattr $C$DW$401, DW_AT_decl_line(0x65)
    5450                            .dwattr $C$DW$401, DW_AT_decl_column(0x0e)
    5451                    $C$DW$402       .dwtag  DW_TAG_member
    5452                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$22)
    5453                            .dwattr $C$DW$402, DW_AT_name("ui16ReadBatchSize")
    5454                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    5455                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5456                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5457                            .dwattr $C$DW$402, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5458                            .dwattr $C$DW$402, DW_AT_decl_line(0x6a)
    5459                            .dwattr $C$DW$402, DW_AT_decl_column(0x0e)
    5460                    $C$DW$403       .dwtag  DW_TAG_member
    5461                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$28)
    5462                            .dwattr $C$DW$403, DW_AT_name("pfnCallback")
    5463                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("pfnCallback")
    5464                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5465                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5466                            .dwattr $C$DW$403, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5467                            .dwattr $C$DW$403, DW_AT_decl_line(0x6f)
    5468                            .dwattr $C$DW$403, DW_AT_decl_column(0x16)
    5469                    $C$DW$404       .dwtag  DW_TAG_member
    5470                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$3)
    5471                            .dwattr $C$DW$404, DW_AT_name("pvCallbackData")
    5472                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("pvCallbackData")
    5473                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5474                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5475                            .dwattr $C$DW$404, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5476                            .dwattr $C$DW$404, DW_AT_decl_line(0x74)
    5477                            .dwattr $C$DW$404, DW_AT_decl_column(0x0b)
    5478                            .dwendtag $C$DW$T$29
    5479                    
    5480                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5481                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    5482                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    5483                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMCommand")
    5484                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    5485                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    5486                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5487                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    5488                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    5489                    
    5490                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    5491                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    5492                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    5493                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    5494                    $C$DW$405       .dwtag  DW_TAG_subrange_type
    5495                            .dwattr $C$DW$405, DW_AT_upper_bound(0x09)
    5496                            .dwendtag $C$DW$T$31
    5497                    
    5498                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    5499                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$30)
    5500                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  101

    5501                    
    5502                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5503                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    5504                    $C$DW$406       .dwtag  DW_TAG_member
    5505                            .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$24)
    5506                            .dwattr $C$DW$406, DW_AT_name("ui32Base")
    5507                            .dwattr $C$DW$406, DW_AT_TI_symbol_name("ui32Base")
    5508                            .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5509                            .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5510                            .dwattr $C$DW$406, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5511                            .dwattr $C$DW$406, DW_AT_decl_line(0x82)
    5512                            .dwattr $C$DW$406, DW_AT_decl_column(0x0e)
    5513                    $C$DW$407       .dwtag  DW_TAG_member
    5514                            .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    5515                            .dwattr $C$DW$407, DW_AT_name("ui8Int")
    5516                            .dwattr $C$DW$407, DW_AT_TI_symbol_name("ui8Int")
    5517                            .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5518                            .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5519                            .dwattr $C$DW$407, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5520                            .dwattr $C$DW$407, DW_AT_decl_line(0x87)
    5521                            .dwattr $C$DW$407, DW_AT_decl_column(0x0d)
    5522                    $C$DW$408       .dwtag  DW_TAG_member
    5523                            .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    5524                            .dwattr $C$DW$408, DW_AT_name("ui8TxDMA")
    5525                            .dwattr $C$DW$408, DW_AT_TI_symbol_name("ui8TxDMA")
    5526                            .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5527                            .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5528                            .dwattr $C$DW$408, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5529                            .dwattr $C$DW$408, DW_AT_decl_line(0x8c)
    5530                            .dwattr $C$DW$408, DW_AT_decl_column(0x0d)
    5531                    $C$DW$409       .dwtag  DW_TAG_member
    5532                            .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    5533                            .dwattr $C$DW$409, DW_AT_name("ui8RxDMA")
    5534                            .dwattr $C$DW$409, DW_AT_TI_symbol_name("ui8RxDMA")
    5535                            .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5536                            .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5537                            .dwattr $C$DW$409, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5538                            .dwattr $C$DW$409, DW_AT_decl_line(0x91)
    5539                            .dwattr $C$DW$409, DW_AT_decl_column(0x0d)
    5540                    $C$DW$410       .dwtag  DW_TAG_member
    5541                            .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    5542                            .dwattr $C$DW$410, DW_AT_name("ui8State")
    5543                            .dwattr $C$DW$410, DW_AT_TI_symbol_name("ui8State")
    5544                            .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5545                            .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5546                            .dwattr $C$DW$410, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5547                            .dwattr $C$DW$410, DW_AT_decl_line(0x96)
    5548                            .dwattr $C$DW$410, DW_AT_decl_column(0x0d)
    5549                    $C$DW$411       .dwtag  DW_TAG_member
    5550                            .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    5551                            .dwattr $C$DW$411, DW_AT_name("ui8ReadPtr")
    5552                            .dwattr $C$DW$411, DW_AT_TI_symbol_name("ui8ReadPtr")
    5553                            .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5554                            .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5555                            .dwattr $C$DW$411, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  102

    5556                            .dwattr $C$DW$411, DW_AT_decl_line(0x9c)
    5557                            .dwattr $C$DW$411, DW_AT_decl_column(0x0d)
    5558                    $C$DW$412       .dwtag  DW_TAG_member
    5559                            .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    5560                            .dwattr $C$DW$412, DW_AT_name("ui8WritePtr")
    5561                            .dwattr $C$DW$412, DW_AT_TI_symbol_name("ui8WritePtr")
    5562                            .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5563                            .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5564                            .dwattr $C$DW$412, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5565                            .dwattr $C$DW$412, DW_AT_decl_line(0xa2)
    5566                            .dwattr $C$DW$412, DW_AT_decl_column(0x0d)
    5567                    $C$DW$413       .dwtag  DW_TAG_member
    5568                            .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$22)
    5569                            .dwattr $C$DW$413, DW_AT_name("ui16Index")
    5570                            .dwattr $C$DW$413, DW_AT_TI_symbol_name("ui16Index")
    5571                            .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5572                            .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5573                            .dwattr $C$DW$413, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5574                            .dwattr $C$DW$413, DW_AT_decl_line(0xa7)
    5575                            .dwattr $C$DW$413, DW_AT_decl_column(0x0e)
    5576                    $C$DW$414       .dwtag  DW_TAG_member
    5577                            .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$31)
    5578                            .dwattr $C$DW$414, DW_AT_name("pCommands")
    5579                            .dwattr $C$DW$414, DW_AT_TI_symbol_name("pCommands")
    5580                            .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5581                            .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5582                            .dwattr $C$DW$414, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5583                            .dwattr $C$DW$414, DW_AT_decl_line(0xac)
    5584                            .dwattr $C$DW$414, DW_AT_decl_column(0x12)
    5585                            .dwendtag $C$DW$T$32
    5586                    
    5587                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5588                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    5589                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    5590                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMInstance")
    5591                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    5592                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    5593                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5594                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    5595                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    5596                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    5597                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    5598                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    5599                    
    5600                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5601                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    5602                    $C$DW$415       .dwtag  DW_TAG_member
    5603                            .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$34)
    5604                            .dwattr $C$DW$415, DW_AT_name("psI2CInst")
    5605                            .dwattr $C$DW$415, DW_AT_TI_symbol_name("psI2CInst")
    5606                            .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5607                            .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5608                            .dwattr $C$DW$415, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5609                            .dwattr $C$DW$415, DW_AT_decl_line(0xf0)
    5610                            .dwattr $C$DW$415, DW_AT_decl_column(0x14)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  103

    5611                    $C$DW$416       .dwtag  DW_TAG_member
    5612                            .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$35)
    5613                            .dwattr $C$DW$416, DW_AT_name("pui8Buffer")
    5614                            .dwattr $C$DW$416, DW_AT_TI_symbol_name("pui8Buffer")
    5615                            .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5616                            .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5617                            .dwattr $C$DW$416, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5618                            .dwattr $C$DW$416, DW_AT_decl_line(0xf5)
    5619                            .dwattr $C$DW$416, DW_AT_decl_column(0x0d)
    5620                    $C$DW$417       .dwtag  DW_TAG_member
    5621                            .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$19)
    5622                            .dwattr $C$DW$417, DW_AT_name("ui8State")
    5623                            .dwattr $C$DW$417, DW_AT_TI_symbol_name("ui8State")
    5624                            .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5625                            .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5626                            .dwattr $C$DW$417, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5627                            .dwattr $C$DW$417, DW_AT_decl_line(0xfa)
    5628                            .dwattr $C$DW$417, DW_AT_decl_column(0x0d)
    5629                    $C$DW$418       .dwtag  DW_TAG_member
    5630                            .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$19)
    5631                            .dwattr $C$DW$418, DW_AT_name("ui8Addr")
    5632                            .dwattr $C$DW$418, DW_AT_TI_symbol_name("ui8Addr")
    5633                            .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5634                            .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5635                            .dwattr $C$DW$418, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5636                            .dwattr $C$DW$418, DW_AT_decl_line(0xff)
    5637                            .dwattr $C$DW$418, DW_AT_decl_column(0x0d)
    5638                    $C$DW$419       .dwtag  DW_TAG_member
    5639                            .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$22)
    5640                            .dwattr $C$DW$419, DW_AT_name("ui16Mask")
    5641                            .dwattr $C$DW$419, DW_AT_TI_symbol_name("ui16Mask")
    5642                            .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5643                            .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5644                            .dwattr $C$DW$419, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5645                            .dwattr $C$DW$419, DW_AT_decl_line(0x104)
    5646                            .dwattr $C$DW$419, DW_AT_decl_column(0x0e)
    5647                    $C$DW$420       .dwtag  DW_TAG_member
    5648                            .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$22)
    5649                            .dwattr $C$DW$420, DW_AT_name("ui16Value")
    5650                            .dwattr $C$DW$420, DW_AT_TI_symbol_name("ui16Value")
    5651                            .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5652                            .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5653                            .dwattr $C$DW$420, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5654                            .dwattr $C$DW$420, DW_AT_decl_line(0x109)
    5655                            .dwattr $C$DW$420, DW_AT_decl_column(0x0e)
    5656                    $C$DW$421       .dwtag  DW_TAG_member
    5657                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$28)
    5658                            .dwattr $C$DW$421, DW_AT_name("pfnCallback")
    5659                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("pfnCallback")
    5660                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5661                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5662                            .dwattr $C$DW$421, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5663                            .dwattr $C$DW$421, DW_AT_decl_line(0x10f)
    5664                            .dwattr $C$DW$421, DW_AT_decl_column(0x16)
    5665                    $C$DW$422       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  104

    5666                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$3)
    5667                            .dwattr $C$DW$422, DW_AT_name("pvCallbackData")
    5668                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("pvCallbackData")
    5669                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5670                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5671                            .dwattr $C$DW$422, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5672                            .dwattr $C$DW$422, DW_AT_decl_line(0x114)
    5673                            .dwattr $C$DW$422, DW_AT_decl_column(0x0b)
    5674                            .dwendtag $C$DW$T$36
    5675                    
    5676                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5677                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    5678                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    5679                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMReadModifyWrite16")
    5680                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$36)
    5681                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5682                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5683                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x116)
    5684                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    5685                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5686                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5687                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    5688                    
    5689                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5690                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    5691                    $C$DW$423       .dwtag  DW_TAG_member
    5692                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$34)
    5693                            .dwattr $C$DW$423, DW_AT_name("psI2CInst")
    5694                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("psI2CInst")
    5695                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5696                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5697                            .dwattr $C$DW$423, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5698                            .dwattr $C$DW$423, DW_AT_decl_line(0xbc)
    5699                            .dwattr $C$DW$423, DW_AT_decl_column(0x14)
    5700                    $C$DW$424       .dwtag  DW_TAG_member
    5701                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$35)
    5702                            .dwattr $C$DW$424, DW_AT_name("pui8Buffer")
    5703                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("pui8Buffer")
    5704                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5705                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5706                            .dwattr $C$DW$424, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5707                            .dwattr $C$DW$424, DW_AT_decl_line(0xc1)
    5708                            .dwattr $C$DW$424, DW_AT_decl_column(0x0d)
    5709                    $C$DW$425       .dwtag  DW_TAG_member
    5710                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    5711                            .dwattr $C$DW$425, DW_AT_name("ui8State")
    5712                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("ui8State")
    5713                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5714                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5715                            .dwattr $C$DW$425, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5716                            .dwattr $C$DW$425, DW_AT_decl_line(0xc6)
    5717                            .dwattr $C$DW$425, DW_AT_decl_column(0x0d)
    5718                    $C$DW$426       .dwtag  DW_TAG_member
    5719                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$19)
    5720                            .dwattr $C$DW$426, DW_AT_name("ui8Addr")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  105

    5721                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("ui8Addr")
    5722                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5723                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5724                            .dwattr $C$DW$426, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5725                            .dwattr $C$DW$426, DW_AT_decl_line(0xcb)
    5726                            .dwattr $C$DW$426, DW_AT_decl_column(0x0d)
    5727                    $C$DW$427       .dwtag  DW_TAG_member
    5728                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    5729                            .dwattr $C$DW$427, DW_AT_name("ui8Mask")
    5730                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("ui8Mask")
    5731                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5732                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5733                            .dwattr $C$DW$427, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5734                            .dwattr $C$DW$427, DW_AT_decl_line(0xd0)
    5735                            .dwattr $C$DW$427, DW_AT_decl_column(0x0d)
    5736                    $C$DW$428       .dwtag  DW_TAG_member
    5737                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    5738                            .dwattr $C$DW$428, DW_AT_name("ui8Value")
    5739                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("ui8Value")
    5740                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5741                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5742                            .dwattr $C$DW$428, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5743                            .dwattr $C$DW$428, DW_AT_decl_line(0xd5)
    5744                            .dwattr $C$DW$428, DW_AT_decl_column(0x0d)
    5745                    $C$DW$429       .dwtag  DW_TAG_member
    5746                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$28)
    5747                            .dwattr $C$DW$429, DW_AT_name("pfnCallback")
    5748                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("pfnCallback")
    5749                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5750                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5751                            .dwattr $C$DW$429, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5752                            .dwattr $C$DW$429, DW_AT_decl_line(0xdb)
    5753                            .dwattr $C$DW$429, DW_AT_decl_column(0x16)
    5754                    $C$DW$430       .dwtag  DW_TAG_member
    5755                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$3)
    5756                            .dwattr $C$DW$430, DW_AT_name("pvCallbackData")
    5757                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("pvCallbackData")
    5758                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5759                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5760                            .dwattr $C$DW$430, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5761                            .dwattr $C$DW$430, DW_AT_decl_line(0xe0)
    5762                            .dwattr $C$DW$430, DW_AT_decl_column(0x0b)
    5763                            .dwendtag $C$DW$T$37
    5764                    
    5765                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5766                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xb7)
    5767                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    5768                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMReadModifyWrite8")
    5769                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    5770                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5771                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5772                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xe2)
    5773                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    5774                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    5775                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  106

    5776                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    5777                    
    5778                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5779                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    5780                    $C$DW$431       .dwtag  DW_TAG_member
    5781                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$34)
    5782                            .dwattr $C$DW$431, DW_AT_name("psI2CInst")
    5783                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("psI2CInst")
    5784                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5785                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5786                            .dwattr $C$DW$431, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5787                            .dwattr $C$DW$431, DW_AT_decl_line(0x123)
    5788                            .dwattr $C$DW$431, DW_AT_decl_column(0x14)
    5789                    $C$DW$432       .dwtag  DW_TAG_member
    5790                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$38)
    5791                            .dwattr $C$DW$432, DW_AT_name("pui8Buffer")
    5792                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("pui8Buffer")
    5793                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5794                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5795                            .dwattr $C$DW$432, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5796                            .dwattr $C$DW$432, DW_AT_decl_line(0x128)
    5797                            .dwattr $C$DW$432, DW_AT_decl_column(0x0d)
    5798                    $C$DW$433       .dwtag  DW_TAG_member
    5799                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$22)
    5800                            .dwattr $C$DW$433, DW_AT_name("ui16Count")
    5801                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("ui16Count")
    5802                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5803                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5804                            .dwattr $C$DW$433, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5805                            .dwattr $C$DW$433, DW_AT_decl_line(0x12d)
    5806                            .dwattr $C$DW$433, DW_AT_decl_column(0x0e)
    5807                    $C$DW$434       .dwtag  DW_TAG_member
    5808                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    5809                            .dwattr $C$DW$434, DW_AT_name("pui8Data")
    5810                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("pui8Data")
    5811                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5812                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5813                            .dwattr $C$DW$434, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5814                            .dwattr $C$DW$434, DW_AT_decl_line(0x132)
    5815                            .dwattr $C$DW$434, DW_AT_decl_column(0x14)
    5816                    $C$DW$435       .dwtag  DW_TAG_member
    5817                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$28)
    5818                            .dwattr $C$DW$435, DW_AT_name("pfnCallback")
    5819                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("pfnCallback")
    5820                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5821                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5822                            .dwattr $C$DW$435, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5823                            .dwattr $C$DW$435, DW_AT_decl_line(0x137)
    5824                            .dwattr $C$DW$435, DW_AT_decl_column(0x16)
    5825                    $C$DW$436       .dwtag  DW_TAG_member
    5826                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$3)
    5827                            .dwattr $C$DW$436, DW_AT_name("pvCallbackData")
    5828                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("pvCallbackData")
    5829                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5830                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  107

    5831                            .dwattr $C$DW$436, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5832                            .dwattr $C$DW$436, DW_AT_decl_line(0x13c)
    5833                            .dwattr $C$DW$436, DW_AT_decl_column(0x0b)
    5834                            .dwendtag $C$DW$T$39
    5835                    
    5836                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5837                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x11e)
    5838                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    5839                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMWrite8")
    5840                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$39)
    5841                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    5842                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5843                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x13e)
    5844                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    5845                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    5846                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    5847                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    5848                    
    5849                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5850                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
    5851                    $C$DW$437       .dwtag  DW_TAG_member
    5852                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$34)
    5853                            .dwattr $C$DW$437, DW_AT_name("psI2CInst")
    5854                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("psI2CInst")
    5855                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5856                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5857                            .dwattr $C$DW$437, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5858                            .dwattr $C$DW$437, DW_AT_decl_line(0x14c)
    5859                            .dwattr $C$DW$437, DW_AT_decl_column(0x14)
    5860                    $C$DW$438       .dwtag  DW_TAG_member
    5861                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$23)
    5862                            .dwattr $C$DW$438, DW_AT_name("pui8Data")
    5863                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("pui8Data")
    5864                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5865                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5866                            .dwattr $C$DW$438, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5867                            .dwattr $C$DW$438, DW_AT_decl_line(0x151)
    5868                            .dwattr $C$DW$438, DW_AT_decl_column(0x0e)
    5869                    $C$DW$439       .dwtag  DW_TAG_member
    5870                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$22)
    5871                            .dwattr $C$DW$439, DW_AT_name("ui16Count")
    5872                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("ui16Count")
    5873                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5874                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5875                            .dwattr $C$DW$439, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5876                            .dwattr $C$DW$439, DW_AT_decl_line(0x156)
    5877                            .dwattr $C$DW$439, DW_AT_decl_column(0x0e)
    5878                    $C$DW$440       .dwtag  DW_TAG_member
    5879                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$28)
    5880                            .dwattr $C$DW$440, DW_AT_name("pfnCallback")
    5881                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("pfnCallback")
    5882                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5883                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5884                            .dwattr $C$DW$440, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5885                            .dwattr $C$DW$440, DW_AT_decl_line(0x15b)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  108

    5886                            .dwattr $C$DW$440, DW_AT_decl_column(0x16)
    5887                    $C$DW$441       .dwtag  DW_TAG_member
    5888                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$3)
    5889                            .dwattr $C$DW$441, DW_AT_name("pvCallbackData")
    5890                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("pvCallbackData")
    5891                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5892                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5893                            .dwattr $C$DW$441, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5894                            .dwattr $C$DW$441, DW_AT_decl_line(0x160)
    5895                            .dwattr $C$DW$441, DW_AT_decl_column(0x0b)
    5896                            .dwendtag $C$DW$T$40
    5897                    
    5898                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5899                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x147)
    5900                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    5901                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMRead16BE")
    5902                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$40)
    5903                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5904                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5905                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x162)
    5906                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    5907                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    5908                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    5909                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    5910                    
    5911                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5912                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x14)
    5913                    $C$DW$442       .dwtag  DW_TAG_member
    5914                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$34)
    5915                            .dwattr $C$DW$442, DW_AT_name("psI2CInst")
    5916                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("psI2CInst")
    5917                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5918                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5919                            .dwattr $C$DW$442, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5920                            .dwattr $C$DW$442, DW_AT_decl_line(0x170)
    5921                            .dwattr $C$DW$442, DW_AT_decl_column(0x14)
    5922                    $C$DW$443       .dwtag  DW_TAG_member
    5923                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$38)
    5924                            .dwattr $C$DW$443, DW_AT_name("pui8Buffer")
    5925                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("pui8Buffer")
    5926                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5927                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5928                            .dwattr $C$DW$443, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5929                            .dwattr $C$DW$443, DW_AT_decl_line(0x175)
    5930                            .dwattr $C$DW$443, DW_AT_decl_column(0x0d)
    5931                    $C$DW$444       .dwtag  DW_TAG_member
    5932                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$22)
    5933                            .dwattr $C$DW$444, DW_AT_name("ui16Count")
    5934                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("ui16Count")
    5935                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5936                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5937                            .dwattr $C$DW$444, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5938                            .dwattr $C$DW$444, DW_AT_decl_line(0x17a)
    5939                            .dwattr $C$DW$444, DW_AT_decl_column(0x0e)
    5940                    $C$DW$445       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  109

    5941                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$21)
    5942                            .dwattr $C$DW$445, DW_AT_name("pui8Data")
    5943                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("pui8Data")
    5944                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5945                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5946                            .dwattr $C$DW$445, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5947                            .dwattr $C$DW$445, DW_AT_decl_line(0x17f)
    5948                            .dwattr $C$DW$445, DW_AT_decl_column(0x14)
    5949                    $C$DW$446       .dwtag  DW_TAG_member
    5950                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$28)
    5951                            .dwattr $C$DW$446, DW_AT_name("pfnCallback")
    5952                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("pfnCallback")
    5953                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5954                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5955                            .dwattr $C$DW$446, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5956                            .dwattr $C$DW$446, DW_AT_decl_line(0x184)
    5957                            .dwattr $C$DW$446, DW_AT_decl_column(0x16)
    5958                    $C$DW$447       .dwtag  DW_TAG_member
    5959                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$3)
    5960                            .dwattr $C$DW$447, DW_AT_name("pvCallbackData")
    5961                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("pvCallbackData")
    5962                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5963                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5964                            .dwattr $C$DW$447, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5965                            .dwattr $C$DW$447, DW_AT_decl_line(0x189)
    5966                            .dwattr $C$DW$447, DW_AT_decl_column(0x0b)
    5967                            .dwendtag $C$DW$T$41
    5968                    
    5969                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5970                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x16b)
    5971                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    5972                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("tI2CMWrite16BE")
    5973                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$41)
    5974                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    5975                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5976                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x18b)
    5977                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    5978                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    5979                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    5980                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    5981                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    5982                            .dwattr $C$DW$T$2, DW_AT_name("void")
    5983                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    5984                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    5985                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    5986                    
    5987                    $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    5988                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    5989                    $C$DW$448       .dwtag  DW_TAG_formal_parameter
    5990                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$3)
    5991                    $C$DW$449       .dwtag  DW_TAG_formal_parameter
    5992                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$25)
    5993                            .dwendtag $C$DW$T$26
    5994                    
    5995                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("tSensorCallback")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  110

    5996                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    5997                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    5998                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    5999                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2c)
    6000                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0f)
    6001                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    6002                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    6003                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    6004                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    6005                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6006                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    6007                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6008                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    6009                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6010                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6011                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6012                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    6013                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$5)
    6014                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    6015                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6016                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x2a)
    6017                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x1d)
    6018                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    6019                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    6020                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6021                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6022                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x37)
    6023                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x17)
    6024                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    6025                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6026                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6027                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6028                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    6029                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    6030                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    6031                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6032                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    6033                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    6034                    $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    6035                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$19)
    6036                            .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
    6037                    
    6038                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    6039                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    6040                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    6041                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    6042                    $C$DW$450       .dwtag  DW_TAG_subrange_type
    6043                            .dwattr $C$DW$450, DW_AT_upper_bound(0x03)
    6044                            .dwendtag $C$DW$T$35
    6045                    
    6046                    
    6047                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    6048                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$19)
    6049                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    6050                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  111

    6051                    $C$DW$451       .dwtag  DW_TAG_subrange_type
    6052                            .dwattr $C$DW$451, DW_AT_upper_bound(0x01)
    6053                            .dwendtag $C$DW$T$38
    6054                    
    6055                    $C$DW$T$20      .dwtag  DW_TAG_const_type
    6056                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    6057                    $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    6058                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    6059                            .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    6060                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    6061                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$19)
    6062                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    6063                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6064                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x38)
    6065                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x16)
    6066                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    6067                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6068                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6069                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    6070                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    6071                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6072                            .dwattr $C$DW$T$8, DW_AT_name("short")
    6073                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    6074                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    6075                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$8)
    6076                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    6077                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6078                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2c)
    6079                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x1d)
    6080                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    6081                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    6082                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    6083                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6084                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3a)
    6085                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x17)
    6086                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    6087                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6088                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6089                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    6090                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    6091                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$9)
    6092                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    6093                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6094                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x1fe)
    6095                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x21)
    6096                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    6097                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$9)
    6098                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    6099                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6100                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x1ff)
    6101                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x21)
    6102                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    6103                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$9)
    6104                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    6105                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  112

    6106                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2d)
    6107                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x1c)
    6108                    $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    6109                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$22)
    6110                            .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
    6111                    $C$DW$T$80      .dwtag  DW_TAG_const_type
    6112                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$22)
    6113                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    6114                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    6115                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    6116                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    6117                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$22)
    6118                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    6119                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6120                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x3b)
    6121                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x16)
    6122                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    6123                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    6124                            .dwattr $C$DW$T$10, DW_AT_name("int")
    6125                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    6126                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    6127                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$10)
    6128                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    6129                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6130                            .dwattr $C$DW$T$83, DW_AT_decl_line(0xa6)
    6131                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x1e)
    6132                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    6133                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$10)
    6134                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    6135                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6136                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x2e)
    6137                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x1d)
    6138                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    6139                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    6140                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    6141                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6142                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x47)
    6143                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x17)
    6144                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    6145                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$84)
    6146                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    6147                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6148                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x4a)
    6149                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x17)
    6150                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    6151                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$84)
    6152                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    6153                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6154                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x45)
    6155                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x17)
    6156                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    6157                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$84)
    6158                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    6159                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6160                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x3c)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  113

    6161                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x17)
    6162                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    6163                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$10)
    6164                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    6165                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6166                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x52)
    6167                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x1a)
    6168                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    6169                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    6170                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    6171                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    6172                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    6173                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$11)
    6174                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    6175                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6176                            .dwattr $C$DW$T$90, DW_AT_decl_line(0xac)
    6177                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x1a)
    6178                    $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    6179                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$11)
    6180                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    6181                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6182                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x2f)
    6183                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x1c)
    6184                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    6185                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$24)
    6186                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    6187                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6188                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x48)
    6189                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x16)
    6190                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    6191                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$24)
    6192                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    6193                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6194                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x4b)
    6195                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x16)
    6196                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    6197                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    6198                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    6199                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6200                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x46)
    6201                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x16)
    6202                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    6203                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$24)
    6204                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    6205                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6206                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x3d)
    6207                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x16)
    6208                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    6209                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$11)
    6210                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    6211                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6212                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x53)
    6213                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x1a)
    6214                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    6215                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  114

    6216                            .dwattr $C$DW$T$12, DW_AT_name("long")
    6217                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    6218                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    6219                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$12)
    6220                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    6221                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6222                            .dwattr $C$DW$T$115, DW_AT_decl_line(0xa2)
    6223                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x0e)
    6224                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    6225                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    6226                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    6227                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    6228                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    6229                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$13)
    6230                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    6231                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6232                            .dwattr $C$DW$T$116, DW_AT_decl_line(0xa3)
    6233                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x17)
    6234                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    6235                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    6236                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    6237                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    6238                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    6239                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$14)
    6240                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    6241                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6242                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x1ce)
    6243                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x13)
    6244                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    6245                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$14)
    6246                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    6247                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6248                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x32)
    6249                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x21)
    6250                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    6251                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    6252                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    6253                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6254                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x4e)
    6255                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x17)
    6256                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    6257                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$118)
    6258                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    6259                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6260                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x40)
    6261                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x17)
    6262                    $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    6263                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$14)
    6264                            .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    6265                            .dwattr $C$DW$T$121, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6266                            .dwattr $C$DW$T$121, DW_AT_decl_line(0x56)
    6267                            .dwattr $C$DW$T$121, DW_AT_decl_column(0x20)
    6268                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    6269                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    6270                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  115

    6271                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    6272                    $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    6273                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$15)
    6274                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    6275                            .dwattr $C$DW$T$122, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6276                            .dwattr $C$DW$T$122, DW_AT_decl_line(0x1cf)
    6277                            .dwattr $C$DW$T$122, DW_AT_decl_column(0x14)
    6278                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    6279                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$15)
    6280                            .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    6281                            .dwattr $C$DW$T$123, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6282                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x33)
    6283                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x20)
    6284                    $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    6285                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    6286                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    6287                            .dwattr $C$DW$T$124, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6288                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x4f)
    6289                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x16)
    6290                    $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    6291                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$123)
    6292                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    6293                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6294                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x41)
    6295                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x16)
    6296                    $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    6297                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$15)
    6298                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    6299                            .dwattr $C$DW$T$126, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6300                            .dwattr $C$DW$T$126, DW_AT_decl_line(0x57)
    6301                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x20)
    6302                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    6303                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    6304                            .dwattr $C$DW$T$16, DW_AT_name("float")
    6305                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    6306                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    6307                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    6308                            .dwattr $C$DW$T$17, DW_AT_name("double")
    6309                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    6310                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    6311                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    6312                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    6313                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    6314                    $C$DW$T$58      .dwtag  DW_TAG_base_type
    6315                            .dwattr $C$DW$T$58, DW_AT_encoding(DW_ATE_unsigned_char)
    6316                            .dwattr $C$DW$T$58, DW_AT_name("unsigned char")
    6317                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    6318                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("_Sysch_t")
    6319                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$6)
    6320                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    6321                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6322                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x23a)
    6323                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x0e)
    6324                    $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    6325                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$6)
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  116

    6326                            .dwattr $C$DW$T$129, DW_AT_address_class(0x20)
    6327                    $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("__builtin_va_list")
    6328                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
    6329                            .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    6330                            .dwattr $C$DW$T$130, DW_AT_decl_file("../Drivers/i2cm_drv.c")
    6331                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x8d2)
    6332                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x01)
    6333                    
    6334                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6335                            .dwattr $C$DW$T$42, DW_AT_name("__va_list")
    6336                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    6337                    $C$DW$452       .dwtag  DW_TAG_member
    6338                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$3)
    6339                            .dwattr $C$DW$452, DW_AT_name("__ap")
    6340                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("__ap")
    6341                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6342                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    6343                            .dwattr $C$DW$452, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    6344                            .dwattr $C$DW$452, DW_AT_decl_line(0x32)
    6345                            .dwattr $C$DW$452, DW_AT_decl_column(0x0c)
    6346                            .dwendtag $C$DW$T$42
    6347                    
    6348                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    6349                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x31)
    6350                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    6351                    $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    6352                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$42)
    6353                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    6354                            .dwattr $C$DW$T$131, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6355                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x33)
    6356                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x03)
    6357                    $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("_Va_list")
    6358                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    6359                            .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    6360                            .dwattr $C$DW$T$132, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    6361                            .dwattr $C$DW$T$132, DW_AT_decl_line(0x218)
    6362                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x17)
    6363                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    6364                    
    6365                    ;***************************************************************
    6366                    ;* DWARF CIE ENTRIES                                           *
    6367                    ;***************************************************************
    6368                    
    6369                    $C$DW$CIE       .dwcie 14
    6370                            .dwcfi  cfa_register, 13
    6371                            .dwcfi  cfa_offset, 0
    6372                            .dwcfi  undefined, 0
    6373                            .dwcfi  undefined, 1
    6374                            .dwcfi  undefined, 2
    6375                            .dwcfi  undefined, 3
    6376                            .dwcfi  same_value, 4
    6377                            .dwcfi  same_value, 5
    6378                            .dwcfi  same_value, 6
    6379                            .dwcfi  same_value, 7
    6380                            .dwcfi  same_value, 8
TI ARM Assembler PC v5.1.7 Tue Sep 16 08:38:45 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
i2cm_drv.asm                                                         PAGE  117

    6381                            .dwcfi  same_value, 9
    6382                            .dwcfi  same_value, 10
    6383                            .dwcfi  same_value, 11
    6384                            .dwcfi  undefined, 12
    6385                            .dwcfi  undefined, 13
    6386                            .dwcfi  undefined, 14
    6387                            .dwcfi  undefined, 14
    6388                            .dwcfi  undefined, 7
    6389                            .dwcfi  undefined, 64
    6390                            .dwcfi  undefined, 65
    6391                            .dwcfi  undefined, 66
    6392                            .dwcfi  undefined, 67
